TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//###########################################################################
//
// FILE:    emac_eqos_hw.h
//
// TITLE:   Definitions for the EMAC registers.
//
//###########################################################################
// 
// C2000Ware v26.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef ETHERNET_EQOS_HW_H
#define ETHERNET_EQOS_HW_H

//*****************************************************************************
//
// The following are defines for the EMAC register offsets
//
//*****************************************************************************
#define ETHERNET_O_MAC_CONFIGURATION  0x0U
#define ETHERNET_O_MAC_EXT_CONFIGURATION  0x4U
#define ETHERNET_O_MAC_PACKET_FILTER  0x8U
#define ETHERNET_O_MAC_WATCHDOG_TIMEOUT  0xCU
#define ETHERNET_O_MAC_HASH_TABLE_REG0  0x10U
#define ETHERNET_O_MAC_HASH_TABLE_REG1  0x14U
#define ETHERNET_O_MAC_VLAN_TAG_CTRL  0x50U
#define ETHERNET_O_MAC_VLAN_TAG_DATA  0x54U
#define ETHERNET_O_MAC_VLAN_HASH_TABLE  0x58U
#define ETHERNET_O_MAC_VLAN_INCL      0x60U
#define ETHERNET_O_MAC_INNER_VLAN_INCL  0x64U
#define ETHERNET_O_MAC_Q0_TX_FLOW_CTRL  0x70U
#define ETHERNET_O_MAC_RX_FLOW_CTRL   0x90U
#define ETHERNET_O_MAC_RXQ_CTRL4  0x94U
#define ETHERNET_O_MAC_RXQ_CTRL0      0xA0U
#define ETHERNET_O_MAC_RXQ_CTRL1      0xA4U
#define ETHERNET_O_MAC_RXQ_CTRL2      0xA8U
#define ETHERNET_O_MAC_INTERRUPT_STATUS  0xB0U
#define ETHERNET_O_MAC_INTERRUPT_ENABLE  0xB4U
#define ETHERNET_O_MAC_RX_TX_STATUS   0xB8U
#define ETHERNET_O_MAC_PMT_CONTROL_STATUS  0xC0U
#define ETHERNET_O_MAC_RWK_PACKET_FILTER  0xC4U
#define ETHERNET_O_MAC_LPI_CONTROL_STATUS  0xD0U
#define ETHERNET_O_MAC_LPI_TIMERS_CONTROL  0xD4U
#define ETHERNET_O_MAC_LPI_ENTRY_TIMER  0xD8U
#define ETHERNET_O_MAC_1US_TIC_COUNTER  0xDCU
#define ETHERNET_O_MAC_VERSION        0x110U
#define ETHERNET_O_MAC_DEBUG          0x114U
#define ETHERNET_O_MAC_HW_FEATURE0    0x11CU
#define ETHERNET_O_MAC_HW_FEATURE1    0x120U
#define ETHERNET_O_MAC_HW_FEATURE2    0x124U
#define ETHERNET_O_MAC_HW_FEATURE3    0x128U
#define ETHERNET_O_MAC_MDIO_ADDRESS   0x200U
#define ETHERNET_O_MAC_MDIO_DATA      0x204U
#define ETHERNET_O_MAC_ARP_ADDRESS    0x210U
#define ETHERNET_O_MAC_ADDRESS0_HIGH  0x300U
#define ETHERNET_O_MAC_ADDRESS0_LOW   0x304U
#define ETHERNET_O_MAC_ADDRESS1_HIGH  0x308U
#define ETHERNET_O_MAC_ADDRESS1_LOW   0x30CU
#define ETHERNET_O_MAC_ADDRESS2_HIGH  0x310U
#define ETHERNET_O_MAC_ADDRESS2_LOW   0x314U
#define ETHERNET_O_MAC_ADDRESS3_HIGH  0x318U
#define ETHERNET_O_MAC_ADDRESS3_LOW   0x31CU
#define ETHERNET_O_MAC_ADDRESS4_HIGH  0x320U
#define ETHERNET_O_MAC_ADDRESS4_LOW  0x324U
#define ETHERNET_O_MAC_ADDRESS5_HIGH  0x328U
#define ETHERNET_O_MAC_ADDRESS5_LOW  0x32CU
#define ETHERNET_O_MAC_ADDRESS6_HIGH  0x330U
#define ETHERNET_O_MAC_ADDRESS6_LOW  0x334U
#define ETHERNET_O_MAC_ADDRESS7_HIGH  0x338U
#define ETHERNET_O_MAC_ADDRESS7_LOW  0x33CU
#define ETHERNET_O_MMC_CONTROL        0x700U
#define ETHERNET_O_MMC_RX_INTERRUPT   0x704U
#define ETHERNET_O_MMC_TX_INTERRUPT   0x708U
#define ETHERNET_O_MMC_RX_INTERRUPT_MASK  0x70CU
#define ETHERNET_O_MMC_TX_INTERRUPT_MASK  0x710U
#define ETHERNET_O_TX_OCTET_COUNT_GOOD_BAD  0x714U
#define ETHERNET_O_TX_PACKET_COUNT_GOOD_BAD  0x718U
#define ETHERNET_O_TX_BROADCAST_PACKETS_GOOD  0x71CU
#define ETHERNET_O_TX_MULTICAST_PACKETS_GOOD  0x720U
#define ETHERNET_O_TX_64OCTETS_PACKETS_GOOD_BAD  0x724U
#define ETHERNET_O_TX_65TO127OCTETS_PACKETS_GOOD_BAD  0x728U
#define ETHERNET_O_TX_128TO255OCTETS_PACKETS_GOOD_BAD  0x72CU
#define ETHERNET_O_TX_256TO511OCTETS_PACKETS_GOOD_BAD  0x730U
#define ETHERNET_O_TX_512TO1023OCTETS_PACKETS_GOOD_BAD  0x734U
#define ETHERNET_O_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD  0x738U
#define ETHERNET_O_TX_UNICAST_PACKETS_GOOD_BAD  0x73CU
#define ETHERNET_O_TX_MULTICAST_PACKETS_GOOD_BAD  0x740U
#define ETHERNET_O_TX_BROADCAST_PACKETS_GOOD_BAD  0x744U
#define ETHERNET_O_TX_UNDERFLOW_ERROR_PACKETS  0x748U
#define ETHERNET_O_TX_SINGLE_COLLISION_GOOD_PACKETS  0x74CU
#define ETHERNET_O_TX_MULTIPLE_COLLISION_GOOD_PACKETS  0x750U
#define ETHERNET_O_TX_DEFERRED_PACKETS  0x754U
#define ETHERNET_O_TX_LATE_COLLISION_PACKETS  0x758U
#define ETHERNET_O_TX_EXCESSIVE_COLLISION_PACKETS  0x75CU
#define ETHERNET_O_TX_CARRIER_ERROR_PACKETS  0x760U
#define ETHERNET_O_TX_OCTET_COUNT_GOOD  0x764U
#define ETHERNET_O_TX_PACKET_COUNT_GOOD  0x768U
#define ETHERNET_O_TX_EXCESSIVE_DEFERRAL_ERROR  0x76CU
#define ETHERNET_O_TX_PAUSE_PACKETS   0x770U
#define ETHERNET_O_TX_VLAN_PACKETS_GOOD  0x774U
#define ETHERNET_O_TX_OSIZE_PACKETS_GOOD  0x778U
#define ETHERNET_O_RX_PACKETS_COUNT_GOOD_BAD  0x780U
#define ETHERNET_O_RX_OCTET_COUNT_GOOD_BAD  0x784U
#define ETHERNET_O_RX_OCTET_COUNT_GOOD  0x788U
#define ETHERNET_O_RX_BROADCAST_PACKETS_GOOD  0x78CU
#define ETHERNET_O_RX_MULTICAST_PACKETS_GOOD  0x790U
#define ETHERNET_O_RX_CRC_ERROR_PACKETS  0x794U
#define ETHERNET_O_RX_ALIGNMENT_ERROR_PACKETS  0x798U
#define ETHERNET_O_RX_RUNT_ERROR_PACKETS  0x79CU
#define ETHERNET_O_RX_JABBER_ERROR_PACKETS  0x7A0U
#define ETHERNET_O_RX_UNDERSIZE_PACKETS_GOOD  0x7A4U
#define ETHERNET_O_RX_OVERSIZE_PACKETS_GOOD  0x7A8U
#define ETHERNET_O_RX_64OCTETS_PACKETS_GOOD_BAD  0x7ACU
#define ETHERNET_O_RX_65TO127OCTETS_PACKETS_GOOD_BAD  0x7B0U
#define ETHERNET_O_RX_128TO255OCTETS_PACKETS_GOOD_BAD  0x7B4U
#define ETHERNET_O_RX_256TO511OCTETS_PACKETS_GOOD_BAD  0x7B8U
#define ETHERNET_O_RX_512TO1023OCTETS_PACKETS_GOOD_BAD  0x7BCU
#define ETHERNET_O_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD  0x7C0U
#define ETHERNET_O_RX_UNICAST_PACKETS_GOOD  0x7C4U
#define ETHERNET_O_RX_LENGTH_ERROR_PACKETS  0x7C8U
#define ETHERNET_O_RX_OUT_OF_RANGE_TYPE_PACKETS  0x7CCU
#define ETHERNET_O_RX_PAUSE_PACKETS   0x7D0U
#define ETHERNET_O_RX_FIFO_OVERFLOW_PACKETS  0x7D4U
#define ETHERNET_O_RX_VLAN_PACKETS_GOOD_BAD  0x7D8U
#define ETHERNET_O_RX_WATCHDOG_ERROR_PACKETS  0x7DCU
#define ETHERNET_O_RX_RECEIVE_ERROR_PACKETS  0x7E0U
#define ETHERNET_O_RX_CONTROL_PACKETS_GOOD  0x7E4U
#define ETHERNET_O_TX_LPI_USEC_CNTR   0x7ECU
#define ETHERNET_O_TX_LPI_TRAN_CNTR   0x7F0U
#define ETHERNET_O_RX_LPI_USEC_CNTR   0x7F4U
#define ETHERNET_O_RX_LPI_TRAN_CNTR   0x7F8U
#define ETHERNET_O_MMC_IPC_RX_INTERRUPT_MASK  0x800U
#define ETHERNET_O_MMC_IPC_RX_INTERRUPT  0x808U
#define ETHERNET_O_RXIPV4_GOOD_PACKETS  0x810U
#define ETHERNET_O_RXIPV4_HEADER_ERROR_PACKETS  0x814U
#define ETHERNET_O_RXIPV4_NO_PAYLOAD_PACKETS  0x818U
#define ETHERNET_O_RXIPV4_FRAGMENTED_PACKETS  0x81CU
#define ETHERNET_O_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS  0x820U
#define ETHERNET_O_RXIPV6_GOOD_PACKETS  0x824U
#define ETHERNET_O_RXIPV6_HEADER_ERROR_PACKETS  0x828U
#define ETHERNET_O_RXIPV6_NO_PAYLOAD_PACKETS  0x82CU
#define ETHERNET_O_RXUDP_GOOD_PACKETS  0x830U
#define ETHERNET_O_RXUDP_ERROR_PACKETS  0x834U
#define ETHERNET_O_RXTCP_GOOD_PACKETS  0x838U
#define ETHERNET_O_RXTCP_ERROR_PACKETS  0x83CU
#define ETHERNET_O_RXICMP_GOOD_PACKETS  0x840U
#define ETHERNET_O_RXICMP_ERROR_PACKETS  0x844U
#define ETHERNET_O_RXIPV4_GOOD_OCTETS  0x850U
#define ETHERNET_O_RXIPV4_HEADER_ERROR_OCTETS  0x854U
#define ETHERNET_O_RXIPV4_NO_PAYLOAD_OCTETS  0x858U
#define ETHERNET_O_RXIPV4_FRAGMENTED_OCTETS  0x85CU
#define ETHERNET_O_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS  0x860U
#define ETHERNET_O_RXIPV6_GOOD_OCTETS  0x864U
#define ETHERNET_O_RXIPV6_HEADER_ERROR_OCTETS  0x868U
#define ETHERNET_O_RXIPV6_NO_PAYLOAD_OCTETS  0x86CU
#define ETHERNET_O_RXUDP_GOOD_OCTETS  0x870U
#define ETHERNET_O_RXUDP_ERROR_OCTETS  0x874U
#define ETHERNET_O_RXTCP_GOOD_OCTETS  0x878U
#define ETHERNET_O_RXTCP_ERROR_OCTETS  0x87CU
#define ETHERNET_O_RXICMP_GOOD_OCTETS  0x880U
#define ETHERNET_O_RXICMP_ERROR_OCTETS  0x884U
#define ETHERNET_O_MAC_L3_L4_CONTROL0  0x900U
#define ETHERNET_O_MAC_LAYER4_ADDRESS0  0x904U
#define ETHERNET_O_MAC_LAYER3_ADDR0_REG0  0x910U
#define ETHERNET_O_MAC_LAYER3_ADDR1_REG0  0x914U
#define ETHERNET_O_MAC_LAYER3_ADDR2_REG0  0x918U
#define ETHERNET_O_MAC_LAYER3_ADDR3_REG0  0x91CU
#define ETHERNET_O_MAC_L3_L4_CONTROL1  0x930U
#define ETHERNET_O_MAC_LAYER4_ADDRESS1  0x934U
#define ETHERNET_O_MAC_LAYER3_ADDR0_REG1  0x940U
#define ETHERNET_O_MAC_LAYER3_ADDR1_REG1  0x944U
#define ETHERNET_O_MAC_LAYER3_ADDR2_REG1  0x948U
#define ETHERNET_O_MAC_LAYER3_ADDR3_REG1  0x94CU
#define ETHERNET_O_MAC_L3_L4_CONTROL2  0x960U
#define ETHERNET_O_MAC_LAYER4_ADDRESS2  0x964U
#define ETHERNET_O_MAC_LAYER3_ADDR0_REG2  0x970U
#define ETHERNET_O_MAC_LAYER3_ADDR1_REG2  0x974U
#define ETHERNET_O_MAC_LAYER3_ADDR2_REG2  0x978U
#define ETHERNET_O_MAC_LAYER3_ADDR3_REG2  0x97CU
#define ETHERNET_O_MAC_L3_L4_CONTROL3  0x990U
#define ETHERNET_O_MAC_LAYER4_ADDRESS3  0x994U
#define ETHERNET_O_MAC_LAYER3_ADDR0_REG3  0x9A0U
#define ETHERNET_O_MAC_LAYER3_ADDR1_REG3  0x9A4U
#define ETHERNET_O_MAC_LAYER3_ADDR2_REG3  0x9A8U
#define ETHERNET_O_MAC_LAYER3_ADDR3_REG3  0x9ACU
#define ETHERNET_O_MAC_TIMESTAMP_CONTROL  0xB00U
#define ETHERNET_O_MAC_SUB_SECOND_INCREMENT  0xB04U
#define ETHERNET_O_MAC_SYSTEM_TIME_SECONDS  0xB08U
#define ETHERNET_O_MAC_SYSTEM_TIME_NANOSECONDS  0xB0CU
#define ETHERNET_O_MAC_SYSTEM_TIME_SECONDS_UPDATE  0xB10U
#define ETHERNET_O_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE  0xB14U
#define ETHERNET_O_MAC_TIMESTAMP_ADDEND  0xB18U
#define ETHERNET_O_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS  0xB1CU
#define ETHERNET_O_MAC_TIMESTAMP_STATUS  0xB20U
#define ETHERNET_O_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS  0xB30U
#define ETHERNET_O_MAC_TX_TIMESTAMP_STATUS_SECONDS  0xB34U
#define ETHERNET_O_MAC_AUXILIARY_CONTROL  0xB40U
#define ETHERNET_O_MAC_AUXILIARY_TIMESTAMP_NANOSECONDS  0xB48U
#define ETHERNET_O_MAC_AUXILIARY_TIMESTAMP_SECONDS  0xB4CU
#define ETHERNET_O_MAC_TIMESTAMP_INGRESS_ASYM_CORR  0xB50U
#define ETHERNET_O_MAC_TIMESTAMP_EGRESS_ASYM_CORR  0xB54U
#define ETHERNET_O_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND  0xB58U
#define ETHERNET_O_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND  0xB5CU
#define ETHERNET_O_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC  0xB60U
#define ETHERNET_O_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC  0xB64U
#define ETHERNET_O_MAC_PPS_CONTROL    0xB70U
#define ETHERNET_O_MAC_PTO_CONTROL    0xBC0U
#define ETHERNET_O_MAC_SOURCE_PORT_IDENTITY0  0xBC4U
#define ETHERNET_O_MAC_SOURCE_PORT_IDENTITY1  0xBC8U
#define ETHERNET_O_MAC_SOURCE_PORT_IDENTITY2  0xBCCU
#define ETHERNET_O_MAC_LOG_MESSAGE_INTERVAL  0xBD0U
#define ETHERNET_O_DMA_MODE           0x1000U
#define ETHERNET_O_DMA_SYSBUS_MODE    0x1004U
#define ETHERNET_O_DMA_INTERRUPT_STATUS  0x1008U
#define ETHERNET_O_DMA_DEBUG_STATUS0  0x100CU
#define ETHERNET_O_DMA_CH0_CONTROL    0x1100U
#define ETHERNET_O_DMA_CH0_TX_CONTROL  0x1104U
#define ETHERNET_O_DMA_CH0_RX_CONTROL  0x1108U
#define ETHERNET_O_DMA_CH0_TXDESC_LIST_ADDRESS  0x1114U
#define ETHERNET_O_DMA_CH0_RXDESC_LIST_ADDRESS  0x111CU
#define ETHERNET_O_DMA_CH0_TXDESC_TAIL_POINTER  0x1120U
#define ETHERNET_O_DMA_CH0_RXDESC_TAIL_POINTER  0x1128U
#define ETHERNET_O_DMA_CH0_TXDESC_RING_LENGTH  0x112CU
#define ETHERNET_O_DMA_CH0_RXDESC_RING_LENGTH  0x1130U
#define ETHERNET_O_DMA_CH0_INTERRUPT_ENABLE  0x1134U
#define ETHERNET_O_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER  0x1138U
#define ETHERNET_O_DMA_CH0_CURRENT_APP_TXDESC  0x1144U
#define ETHERNET_O_DMA_CH0_CURRENT_APP_RXDESC  0x114CU
#define ETHERNET_O_DMA_CH0_CURRENT_APP_TXBUFFER  0x1154U
#define ETHERNET_O_DMA_CH0_CURRENT_APP_RXBUFFER  0x115CU
#define ETHERNET_O_DMA_CH0_STATUS     0x1160U
#define ETHERNET_O_DMA_CH0_MISS_FRAME_CNT  0x116CU
#define ETHERNET_O_DMA_CH1_CONTROL    0x1180U
#define ETHERNET_O_DMA_CH1_TX_CONTROL  0x1184U
#define ETHERNET_O_DMA_CH1_RX_CONTROL  0x1188U
#define ETHERNET_O_DMA_CH1_TXDESC_LIST_ADDRESS  0x1194U
#define ETHERNET_O_DMA_CH1_RXDESC_LIST_ADDRESS  0x119CU
#define ETHERNET_O_DMA_CH1_TXDESC_TAIL_POINTER  0x11A0U
#define ETHERNET_O_DMA_CH1_RXDESC_TAIL_POINTER  0x11A8U
#define ETHERNET_O_DMA_CH1_TXDESC_RING_LENGTH  0x11ACU
#define ETHERNET_O_DMA_CH1_RXDESC_RING_LENGTH  0x11B0U
#define ETHERNET_O_DMA_CH1_INTERRUPT_ENABLE  0x11B4U
#define ETHERNET_O_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER  0x11B8U
#define ETHERNET_O_DMA_CH1_CURRENT_APP_TXDESC  0x11C4U
#define ETHERNET_O_DMA_CH1_CURRENT_APP_RXDESC  0x11CCU
#define ETHERNET_O_DMA_CH1_CURRENT_APP_TXBUFFER  0x11D4U
#define ETHERNET_O_DMA_CH1_CURRENT_APP_RXBUFFER  0x11DCU
#define ETHERNET_O_DMA_CH1_STATUS     0x11E0U
#define ETHERNET_O_DMA_CH1_MISS_FRAME_CNT  0x11ECU
#define ETHERNET_O_MTL_OPERATION_MODE  0xC00U
#define ETHERNET_O_MTL_DBG_CTL        0xC08U
#define ETHERNET_O_MTL_DBG_STS        0xC0CU
#define ETHERNET_O_MTL_FIFO_DEBUG_DATA  0xC10U
#define ETHERNET_O_MTL_INTERRUPT_STATUS  0xC20U
#define ETHERNET_O_MTL_RXQ_DMA_MAP0   0xC30U
#define ETHERNET_O_MTL_TXQ0_OPERATION_MODE  0xD00U
#define ETHERNET_O_MTL_TXQ0_UNDERFLOW  0xD04U
#define ETHERNET_O_MTL_TXQ0_DEBUG     0xD08U
#define ETHERNET_O_MTL_TXQ0_ETS_STATUS  0xD14U
#define ETHERNET_O_MTL_TXQ0_QUANTUM_WEIGHT  0xD18U
#define ETHERNET_O_MTL_Q0_INTERRUPT_CONTROL_STATUS  0xD2CU
#define ETHERNET_O_MTL_RXQ0_OPERATION_MODE  0xD30U
#define ETHERNET_O_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT  0xD34U
#define ETHERNET_O_MTL_RXQ0_DEBUG     0xD38U
#define ETHERNET_O_MTL_RXQ0_CONTROL   0xD3CU
#define ETHERNET_O_MTL_TXQ1_OPERATION_MODE  0xD40U
#define ETHERNET_O_MTL_TXQ1_UNDERFLOW  0xD44U
#define ETHERNET_O_MTL_TXQ1_DEBUG     0xD48U
#define ETHERNET_O_MTL_TXQ1_ETS_STATUS  0xD54U
#define ETHERNET_O_MTL_TXQ1_QUANTUM_WEIGHT  0xD58U
#define ETHERNET_O_MTL_Q1_INTERRUPT_CONTROL_STATUS  0xD6CU
#define ETHERNET_O_MTL_RXQ1_OPERATION_MODE  0xD70U
#define ETHERNET_O_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT  0xD74U
#define ETHERNET_O_MTL_RXQ1_DEBUG     0xD78U
#define ETHERNET_O_MTL_RXQ1_CONTROL   0xD7CU

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_CONFIGURATION register
//
//*****************************************************************************
#define ETHERNET_MAC_CONFIGURATION_RE  0x1U         // Receiver Enable
#define ETHERNET_MAC_CONFIGURATION_TE  0x2U         // Transmitter Enable
#define ETHERNET_MAC_CONFIGURATION_PRELEN_S  2U
#define ETHERNET_MAC_CONFIGURATION_PRELEN_M  0xCU         // Preamble Length for Transmit
                                               // packets
#define ETHERNET_MAC_CONFIGURATION_DC  0x10U        // Deferral Check
#define ETHERNET_MAC_CONFIGURATION_BL_S  5U
#define ETHERNET_MAC_CONFIGURATION_BL_M  0x60U        // Back-Off Limit
#define ETHERNET_MAC_CONFIGURATION_DR  0x100U       // Disable Retry
#define ETHERNET_MAC_CONFIGURATION_DCRS  0x200U       // Disable Carrier Sense During
                                               // Transmission
#define ETHERNET_MAC_CONFIGURATION_DO  0x400U       // Disable Receive Own
#define ETHERNET_MAC_CONFIGURATION_ECRSFD  0x800U       // Enable Carrier Sense Before
                                               // Transmission in Full-Duplex
                                               // Mode
#define ETHERNET_MAC_CONFIGURATION_LM  0x1000U      // Loopback Mode
#define ETHERNET_MAC_CONFIGURATION_DM  0x2000U      // Duplex Mode
#define ETHERNET_MAC_CONFIGURATION_FES  0x4000U      // Speed
#define ETHERNET_MAC_CONFIGURATION_PS  0x8000U      // Port Select
#define ETHERNET_MAC_CONFIGURATION_JE  0x10000U     // Jumbo Packet Enable
#define ETHERNET_MAC_CONFIGURATION_JD  0x20000U     // Jabber Disable
#define ETHERNET_MAC_CONFIGURATION_WD  0x80000U     // Watchdog Disable
#define ETHERNET_MAC_CONFIGURATION_ACS  0x100000U    // Automatic Pad or CRC
                                               // Stripping
#define ETHERNET_MAC_CONFIGURATION_CST  0x200000U    // CRC stripping for Type
                                               // packets
#define ETHERNET_MAC_CONFIGURATION_S2KP  0x400000U    // IEEE 802.3as Support for 2K
                                               // Packets
#define ETHERNET_MAC_CONFIGURATION_GPSLCE  0x800000U    // Giant Packet Size Limit
                                               // Control Enable
#define ETHERNET_MAC_CONFIGURATION_IPG_S  24U
#define ETHERNET_MAC_CONFIGURATION_IPG_M  0x7000000U   // Inter-Packet Gap
#define ETHERNET_MAC_CONFIGURATION_IPC  0x8000000U   // Checksum Offload
#define ETHERNET_MAC_CONFIGURATION_SARC_S  28U
#define ETHERNET_MAC_CONFIGURATION_SARC_M  0x70000000U  // Source Address Insertion or
                                               // Replacement Control
#define ETHERNET_MAC_CONFIGURATION_ARPEN  0x80000000U  // ARP Offload Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_EXT_CONFIGURATION register
//
//*****************************************************************************
#define ETHERNET_MAC_EXT_CONFIGURATION_GPSL_S  0U
#define ETHERNET_MAC_EXT_CONFIGURATION_GPSL_M  0x3FFFU      // Giant Packet Size Limit
#define ETHERNET_MAC_EXT_CONFIGURATION_DCRCC  0x10000U     // Disable CRC Checking for
                                               // Received Packets
#define ETHERNET_MAC_EXT_CONFIGURATION_SPEN  0x20000U     // Slow Protocol Detection
                                               // Enable
#define ETHERNET_MAC_EXT_CONFIGURATION_USP  0x40000U     // Unicast Slow Protocol Packet
                                               // Detect
#define ETHERNET_MAC_EXT_CONFIGURATION_HDSMS_S  20U
#define ETHERNET_MAC_EXT_CONFIGURATION_HDSMS_M  0x700000U    // Maximum Size for Splitting
                                               // the Header Data
#define ETHERNET_MAC_EXT_CONFIGURATION_EIPGEN  0x1000000U   // Extended Inter-Packet Gap
                                               // Enable
#define ETHERNET_MAC_EXT_CONFIGURATION_EIPG_S  25U
#define ETHERNET_MAC_EXT_CONFIGURATION_EIPG_M  0x3E000000U  // Extended Inter-Packet Gap

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_PACKET_FILTER register
//
//*****************************************************************************
#define ETHERNET_MAC_PACKET_FILTER_PR  0x1U         // Promiscuous Mode
#define ETHERNET_MAC_PACKET_FILTER_HUC  0x2U         // Hash Unicast
#define ETHERNET_MAC_PACKET_FILTER_HMC  0x4U         // Hash Multicast
#define ETHERNET_MAC_PACKET_FILTER_DAIF  0x8U         // DA Inverse Filtering
#define ETHERNET_MAC_PACKET_FILTER_PM  0x10U        // Pass All Multicast
#define ETHERNET_MAC_PACKET_FILTER_DBF  0x20U        // Disable Broadcast Packets
#define ETHERNET_MAC_PACKET_FILTER_PCF_S  6U
#define ETHERNET_MAC_PACKET_FILTER_PCF_M  0xC0U        // Pass Control Packets
#define ETHERNET_MAC_PACKET_FILTER_SAIF  0x100U       // SA Inverse Filtering
#define ETHERNET_MAC_PACKET_FILTER_SAF  0x200U       // Source Address Filter Enable
#define ETHERNET_MAC_PACKET_FILTER_HPF  0x400U       // Hash or Perfect Filter
#define ETHERNET_MAC_PACKET_FILTER_VTFE  0x10000U     // VLAN Tag Filter Enable
#define ETHERNET_MAC_PACKET_FILTER_IPFE  0x100000U    // Layer 3 and Layer 4 Filter
                                               // Enable
#define ETHERNET_MAC_PACKET_FILTER_DNTU  0x200000U    // Drop Non-TCP/UDP over IP
                                               // Packets
#define ETHERNET_MAC_PACKET_FILTER_RA  0x80000000U  // Receive All

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_WATCHDOG_TIMEOUT register
//
//*****************************************************************************
#define ETHERNET_MAC_WATCHDOG_TIMEOUT_WTO_S  0U
#define ETHERNET_MAC_WATCHDOG_TIMEOUT_WTO_M  0xFU         // Watchdog Timeout
#define ETHERNET_MAC_WATCHDOG_TIMEOUT_PWE  0x100U       // Programmable Watchdog Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_VLAN_TAG_CTRL register
//
//*****************************************************************************
#define ETHERNET_MAC_VLAN_TAG_CTRL_OB  0x1U         // Operation Busy
#define ETHERNET_MAC_VLAN_TAG_CTRL_CT  0x2U         // Command Type
#define ETHERNET_MAC_VLAN_TAG_CTRL_OFS_S  2U
#define ETHERNET_MAC_VLAN_TAG_CTRL_OFS_M  0x7CU        // Offset
#define ETHERNET_MAC_VLAN_TAG_CTRL_ETV  0x10000U     // Enable 12-Bit VLAN Tag
                                               // Comparison
#define ETHERNET_MAC_VLAN_TAG_CTRL_VTIM  0x20000U     // VLAN Tag Inverse Match Enable
#define ETHERNET_MAC_VLAN_TAG_CTRL_ESVL  0x40000U     // Enable S-VLAN
#define ETHERNET_MAC_VLAN_TAG_CTRL_ERSVLM  0x80000U     // Enable Receive S-VLAN Match
#define ETHERNET_MAC_VLAN_TAG_CTRL_DOVLTC  0x100000U    // Disable VLAN Type Check
#define ETHERNET_MAC_VLAN_TAG_CTRL_EVLS_S  21U
#define ETHERNET_MAC_VLAN_TAG_CTRL_EVLS_M  0x600000U    // Enable VLAN Tag Stripping on
                                               // Receive
#define ETHERNET_MAC_VLAN_TAG_CTRL_EVLRXS  0x1000000U   // Enable VLAN Tag in Rx status
#define ETHERNET_MAC_VLAN_TAG_CTRL_VTHM  0x2000000U   // VLAN Tag Hash Table Match
                                               // Enable
#define ETHERNET_MAC_VLAN_TAG_CTRL_EDVLP  0x4000000U   // Enable Double VLAN Processing
#define ETHERNET_MAC_VLAN_TAG_CTRL_ERIVLT  0x8000000U   // Enable Inner VLAN Tag
#define ETHERNET_MAC_VLAN_TAG_CTRL_EIVLS_S  28U
#define ETHERNET_MAC_VLAN_TAG_CTRL_EIVLS_M  0x30000000U  // Enable Inner VLAN Tag
                                               // Stripping on Receive
#define ETHERNET_MAC_VLAN_TAG_CTRL_EIVLRXS  0x80000000U  // Enable Inner VLAN Tag in Rx
                                               // Status

