TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
// The following are defines for the bit fields in the MAC_VLAN_TAG_DATA register
//
//*****************************************************************************
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_15_0_S  0U
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_15_0_M  0xFFFFU      // VLAN Tag ID
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_16  0x10000U     // VLAN Tag Enable
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_17  0x20000U     // 12bits or 16bits VLAN
                                               // comparison
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_18  0x40000U     // Disable VLAN Type Comparison
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_19  0x80000U     // Enable S-VLAN Match for
                                               // received Frames
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_20  0x100000U    // Enable Inner VLAN Tag
                                               // Comparison
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_24  0x1000000U   // DMA Channel Number Enable
#define ETHERNET_MAC_VLAN_TAG_DATA_DATA_25  0x2000000U   // DMA Channel Number

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_VLAN_HASH_TABLE register
//
//*****************************************************************************
#define ETHERNET_MAC_VLAN_HASH_TABLE_VLHT_S  0U
#define ETHERNET_MAC_VLAN_HASH_TABLE_VLHT_M  0xFFFFU      // VLAN Hash Table

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_VLAN_INCL register
//
//*****************************************************************************
#define ETHERNET_MAC_VLAN_INCL_VLT_S  0U
#define ETHERNET_MAC_VLAN_INCL_VLT_M  0xFFFFU      // VLAN Tag for Transmit Packets
#define ETHERNET_MAC_VLAN_INCL_VLC_S  16U
#define ETHERNET_MAC_VLAN_INCL_VLC_M  0x30000U     // VLAN Tag Control in Transmit
                                               // Packets
#define ETHERNET_MAC_VLAN_INCL_VLP    0x40000U     // VLAN Priority Control
#define ETHERNET_MAC_VLAN_INCL_CSVL   0x80000U     // C-VLAN or S-VLAN
#define ETHERNET_MAC_VLAN_INCL_VLTI   0x100000U    // VLAN Tag Input
#define ETHERNET_MAC_VLAN_INCL_CBTI   0x200000U    // Channel based tag insertion
#define ETHERNET_MAC_VLAN_INCL_ADDR   0x1000000U   // Address
#define ETHERNET_MAC_VLAN_INCL_RDWR   0x40000000U  // Read write control
#define ETHERNET_MAC_VLAN_INCL_BUSY   0x80000000U  // Busy

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_INNER_VLAN_INCL register
//
//*****************************************************************************
#define ETHERNET_MAC_INNER_VLAN_INCL_VLT_S  0U
#define ETHERNET_MAC_INNER_VLAN_INCL_VLT_M  0xFFFFU      // VLAN Tag for Transmit Packets
#define ETHERNET_MAC_INNER_VLAN_INCL_VLC_S  16U
#define ETHERNET_MAC_INNER_VLAN_INCL_VLC_M  0x30000U     // VLAN Tag Control in Transmit
                                               // Packets
#define ETHERNET_MAC_INNER_VLAN_INCL_VLP  0x40000U     // VLAN Priority Control
#define ETHERNET_MAC_INNER_VLAN_INCL_CSVL  0x80000U     // C-VLAN or S-VLAN
#define ETHERNET_MAC_INNER_VLAN_INCL_VLTI  0x100000U    // VLAN Tag Input

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_Q0_TX_FLOW_CTRL register
//
//*****************************************************************************
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA  0x1U         // Flow Control Busy or
                                               // Backpressure Activate
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_TFE  0x2U         // Transmit Flow Control Enable
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_PLT_S  4U
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_PLT_M  0x70U        // Pause Low Threshold
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_DZPQ  0x80U        // Disable Zero-Quanta Pause
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_PT_S  16U
#define ETHERNET_MAC_Q0_TX_FLOW_CTRL_PT_M  0xFFFF0000U  // Pause Time

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_RX_FLOW_CTRL register
//
//*****************************************************************************
#define ETHERNET_MAC_RX_FLOW_CTRL_RFE  0x1U         // Receive Flow Control Enable
#define ETHERNET_MAC_RX_FLOW_CTRL_UP  0x2U         // Unicast Pause Packet Detect

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_RXQ_CTRL4 register
//
//*****************************************************************************
#define ETHERNET_MAC_RXQ_CTRL4_UFFQE  0x1U         // Unicast Address Filter Fail
                                               // Packets Queuing Enable.

#define ETHERNET_MAC_RXQ_CTRL4_UFFQ  0x2U         // Unicast Address Filter Fail
                                               // Packets Queue.

#define ETHERNET_MAC_RXQ_CTRL4_MFFQE  0x100U       // Multicast Address Filter Fail
                                               // Packets Queuing Enable.

#define ETHERNET_MAC_RXQ_CTRL4_MFFQ  0x200U       // Multicast Address Filter Fail
                                               // Packets Queue.

#define ETHERNET_MAC_RXQ_CTRL4_VFFQE  0x10000U     // VLAN Tag Filter Fail Packets
                                               // Queuing Enable
#define ETHERNET_MAC_RXQ_CTRL4_VFFQ  0x20000U     // VLAN Tag Filter Fail Packets
                                               // Queue

//*****************************************************************************
// The following are defines for the bit fields in the MAC_RXQ_CTRL0 register
//
//*****************************************************************************
#define ETHERNET_MAC_RXQ_CTRL0_RXQ0EN_S  0U
#define ETHERNET_MAC_RXQ_CTRL0_RXQ0EN_M  0x3U         // Receive Queue 0 Enable
#define ETHERNET_MAC_RXQ_CTRL0_RXQ1EN_S  2U
#define ETHERNET_MAC_RXQ_CTRL0_RXQ1EN_M  0xCU         // Receive Queue 1 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_RXQ_CTRL1 register
//
//*****************************************************************************
#define ETHERNET_MAC_RXQ_CTRL1_PTPQ_S  4U
#define ETHERNET_MAC_RXQ_CTRL1_PTPQ_M  0x70U        // PTP Packets Queue
#define ETHERNET_MAC_RXQ_CTRL1_UPQ_S  12U
#define ETHERNET_MAC_RXQ_CTRL1_UPQ_M  0x7000U      // Untagged Packet Queue
#define ETHERNET_MAC_RXQ_CTRL1_MCBCQ_S  16U
#define ETHERNET_MAC_RXQ_CTRL1_MCBCQ_M  0x70000U     // Multicast and Broadcast Queue
                                               //
#define ETHERNET_MAC_RXQ_CTRL1_MCBCQEN  0x100000U    // Multicast and Broadcast Queue
                                               // Enable
#define ETHERNET_MAC_RXQ_CTRL1_TPQC  0x400000U    // Tagged PTP over Ethernet
                                               // Packets Queuing Control.

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_RXQ_CTRL2 register
//
//*****************************************************************************
#define ETHERNET_MAC_RXQ_CTRL2_PSRQ0_S  0U
#define ETHERNET_MAC_RXQ_CTRL2_PSRQ0_M  0xFFU        // Priorities Selected in the
                                               // Receive Queue 0
#define ETHERNET_MAC_RXQ_CTRL2_PSRQ1_S  8U
#define ETHERNET_MAC_RXQ_CTRL2_PSRQ1_M  0xFF00U      // Priorities Selected in the
                                               // Receive Queue 1

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_INTERRUPT_STATUS register
//
//*****************************************************************************
#define ETHERNET_MAC_INTERRUPT_STATUS_PHYIS  0x8U         // PHY Interrupt
#define ETHERNET_MAC_INTERRUPT_STATUS_PMTIS  0x10U        // PMT Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_LPIIS  0x20U        // LPI Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_MMCIS  0x100U       // MMC Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_MMCRXIS  0x200U       // MMC Receive Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_MMCTXIS  0x400U       // MMC Transmit Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_MMCRXIPIS  0x800U       // MMC Receive Checksum Offload
                                               // Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_TSIS  0x1000U      // Timestamp Interrupt Status
#define ETHERNET_MAC_INTERRUPT_STATUS_TXSTSIS  0x2000U      // Transmit Status Interrupt
#define ETHERNET_MAC_INTERRUPT_STATUS_RXSTSIS  0x4000U      // Receive Status Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_INTERRUPT_ENABLE register
//
//*****************************************************************************
#define ETHERNET_MAC_INTERRUPT_ENABLE_PHYIE  0x8U         // PHY Interrupt Enable
#define ETHERNET_MAC_INTERRUPT_ENABLE_PMTIE  0x10U        // PMT Interrupt Enable
#define ETHERNET_MAC_INTERRUPT_ENABLE_LPIIE  0x20U        // LPI Interrupt Enable
#define ETHERNET_MAC_INTERRUPT_ENABLE_TSIE  0x1000U      // Timestamp Interrupt Enable
#define ETHERNET_MAC_INTERRUPT_ENABLE_TXSTSIE  0x2000U      // Transmit Status Interrupt
                                               // Enable
#define ETHERNET_MAC_INTERRUPT_ENABLE_RXSTSIE  0x4000U      // Receive Status Interrupt
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_RX_TX_STATUS register
//
//*****************************************************************************
#define ETHERNET_MAC_RX_TX_STATUS_TJT  0x1U         // Transmit Jabber Timeout
#define ETHERNET_MAC_RX_TX_STATUS_NCARR  0x2U         // No Carrier
#define ETHERNET_MAC_RX_TX_STATUS_LCARR  0x4U         // Loss of Carrier
#define ETHERNET_MAC_RX_TX_STATUS_EXDEF  0x8U         // Excessive Deferral
#define ETHERNET_MAC_RX_TX_STATUS_LCOL  0x10U        // Late Collision
#define ETHERNET_MAC_RX_TX_STATUS_EXCOL  0x20U        // Excessive Collisions
#define ETHERNET_MAC_RX_TX_STATUS_RWT  0x100U       // Receive Watchdog Timeout

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_PMT_CONTROL_STATUS register
//
//*****************************************************************************
#define ETHERNET_MAC_PMT_CONTROL_STATUS_PWRDWN  0x1U         // Power Down
#define ETHERNET_MAC_PMT_CONTROL_STATUS_MGKPKTEN  0x2U         // Magic Packet Enable
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKPKTEN  0x4U         // Remote Wake-Up Packet Enable
#define ETHERNET_MAC_PMT_CONTROL_STATUS_MGKPRCVD  0x20U        // Magic Packet Received
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKPRCVD  0x40U        // Remote Wake-Up Packet
                                               // Received
#define ETHERNET_MAC_PMT_CONTROL_STATUS_GLBLUCAST  0x200U       // Global Unicast
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKPFE  0x400U       // Remote Wake-up Packet
                                               // Forwarding Enable
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKPTR_S  24U
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKPTR_M  0x1F000000U  // Remote Wake-up FIFO Pointer
#define ETHERNET_MAC_PMT_CONTROL_STATUS_RWKFILTRST  0x80000000U  // Remote Wake-Up Packet Filter
                                               // Register Pointer Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LPI_CONTROL_STATUS register
//
//*****************************************************************************
#define ETHERNET_MAC_LPI_CONTROL_STATUS_TLPIEN  0x1U         // Transmit LPI Entry
#define ETHERNET_MAC_LPI_CONTROL_STATUS_TLPIEX  0x2U         // Transmit LPI Exit
#define ETHERNET_MAC_LPI_CONTROL_STATUS_RLPIEN  0x4U         // Receive LPI Entry
#define ETHERNET_MAC_LPI_CONTROL_STATUS_RLPIEX  0x8U         // Receive LPI Exit
#define ETHERNET_MAC_LPI_CONTROL_STATUS_TLPIST  0x100U       // Transmit LPI State
#define ETHERNET_MAC_LPI_CONTROL_STATUS_RLPIST  0x200U       // Receive LPI State
#define ETHERNET_MAC_LPI_CONTROL_STATUS_LPIEN  0x10000U     // LPI Enable
#define ETHERNET_MAC_LPI_CONTROL_STATUS_PLS  0x20000U     // PHY Link Status
#define ETHERNET_MAC_LPI_CONTROL_STATUS_LPITXA  0x80000U     // LPI Tx Automate
#define ETHERNET_MAC_LPI_CONTROL_STATUS_LPIATE  0x100000U    // LPI Timer Enable
#define ETHERNET_MAC_LPI_CONTROL_STATUS_LPITCSE  0x200000U    // LPI Tx Clock Stop Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LPI_TIMERS_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MAC_LPI_TIMERS_CONTROL_TWT_S  0U
#define ETHERNET_MAC_LPI_TIMERS_CONTROL_TWT_M  0xFFFFU      // LPI TW Timer
#define ETHERNET_MAC_LPI_TIMERS_CONTROL_LST_S  16U
#define ETHERNET_MAC_LPI_TIMERS_CONTROL_LST_M  0x3FF0000U   // LPI LS Timer

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LPI_ENTRY_TIMER register
//
//*****************************************************************************
#define ETHERNET_MAC_LPI_ENTRY_TIMER_LPIET_S  3U
#define ETHERNET_MAC_LPI_ENTRY_TIMER_LPIET_M  0xFFFF8U     // LPI Entry Timer

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_1US_TIC_COUNTER register
//
//*****************************************************************************
#define ETHERNET_MAC_1US_TIC_COUNTER_TIC_1US_CNTR_S  0U
#define ETHERNET_MAC_1US_TIC_COUNTER_TIC_1US_CNTR_M  0xFFFU       // 1US TIC Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_VERSION register
//
//*****************************************************************************
#define ETHERNET_MAC_VERSION_SNPSVER_S  0U
#define ETHERNET_MAC_VERSION_SNPSVER_M  0xFFU        // Synopsys-defined Version
                                               // (3.7)
#define ETHERNET_MAC_VERSION_USERVER_S  8U
#define ETHERNET_MAC_VERSION_USERVER_M  0xFF00U      // User-defined Version
                                               // (configured with coreConsultant)

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_DEBUG register
//
//*****************************************************************************
#define ETHERNET_MAC_DEBUG_RPESTS     0x1U         // MAC GMII or MII Receive
                                               // Protocol Engine Status
#define ETHERNET_MAC_DEBUG_RFCFCSTS_S  1U
#define ETHERNET_MAC_DEBUG_RFCFCSTS_M  0x6U         // MAC Receive Packet Controller
                                               // FIFO Status
#define ETHERNET_MAC_DEBUG_TPESTS     0x10000U     // MAC GMII or MII Transmit
                                               // Protocol Engine Status
#define ETHERNET_MAC_DEBUG_TFCSTS_S   17U
#define ETHERNET_MAC_DEBUG_TFCSTS_M   0x60000U     // MAC Transmit Packet
                                               // Controller Status

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_HW_FEATURE0 register
//
//*****************************************************************************
#define ETHERNET_MAC_HW_FEATURE0_MIISEL  0x1U         // 10 or 100 Mbps Support
#define ETHERNET_MAC_HW_FEATURE0_GMIISEL  0x2U         // 1000 Mbps Support
#define ETHERNET_MAC_HW_FEATURE0_HDSEL  0x4U         // Half-duplex Support
#define ETHERNET_MAC_HW_FEATURE0_PCSSEL  0x8U         // PCS Registers (TBI, SGMII, or
                                               // RTBI PHY interface)
#define ETHERNET_MAC_HW_FEATURE0_VLHASH  0x10U        // VLAN Hash Filter Selected
#define ETHERNET_MAC_HW_FEATURE0_SMASEL  0x20U        // SMA (MDIO) Interface
#define ETHERNET_MAC_HW_FEATURE0_RWKSEL  0x40U        // PMT Remote Wake-up Packet
                                               // Enable
#define ETHERNET_MAC_HW_FEATURE0_MGKSEL  0x80U        // PMT Magic Packet Enable
#define ETHERNET_MAC_HW_FEATURE0_MMCSEL  0x100U       // RMON Module Enable
#define ETHERNET_MAC_HW_FEATURE0_ARPOFFSEL  0x200U       // ARP Offload Enabled
#define ETHERNET_MAC_HW_FEATURE0_TSSEL  0x1000U      // IEEE 1588-2008 Timestamp
                                               // Enabled
#define ETHERNET_MAC_HW_FEATURE0_EEESEL  0x2000U      // Energy Efficient Ethernet
                                               // Enabled
#define ETHERNET_MAC_HW_FEATURE0_TXCOESEL  0x4000U      // Transmit Checksum Offload
                                               // Enabled
#define ETHERNET_MAC_HW_FEATURE0_RXCOESEL  0x10000U     // Receive Checksum Offload
                                               // Enabled
#define ETHERNET_MAC_HW_FEATURE0_ADDMACADRSEL_S  18U
#define ETHERNET_MAC_HW_FEATURE0_ADDMACADRSEL_M  0x7C0000U    // MAC Addresses 1-31 Selected
#define ETHERNET_MAC_HW_FEATURE0_MACADR32SEL  0x800000U    // MAC Addresses 32-63 Selected
#define ETHERNET_MAC_HW_FEATURE0_MACADR64SEL  0x1000000U   // MAC Addresses 64-127 Selected
#define ETHERNET_MAC_HW_FEATURE0_TSSTSSEL_S  25U
#define ETHERNET_MAC_HW_FEATURE0_TSSTSSEL_M  0x6000000U   // Timestamp System Time Source
#define ETHERNET_MAC_HW_FEATURE0_SAVLANINS  0x8000000U   // Source Address or VLAN
                                               // Insertion Enable
#define ETHERNET_MAC_HW_FEATURE0_ACTPHYSEL_S  28U
#define ETHERNET_MAC_HW_FEATURE0_ACTPHYSEL_M  0x70000000U  // Active PHY Selected

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_HW_FEATURE1 register
//
//*****************************************************************************
#define ETHERNET_MAC_HW_FEATURE1_RXFIFOSIZE_S  0U
#define ETHERNET_MAC_HW_FEATURE1_RXFIFOSIZE_M  0x1FU        // MTL Receive FIFO Size
#define ETHERNET_MAC_HW_FEATURE1_SPRAM  0x20U        // Single Port RAM Enable
#define ETHERNET_MAC_HW_FEATURE1_TXFIFOSIZE_S  6U
#define ETHERNET_MAC_HW_FEATURE1_TXFIFOSIZE_M  0x7C0U       // MTL Transmit FIFO Size
#define ETHERNET_MAC_HW_FEATURE1_OSTEN  0x800U       // One-Step Timestamping Enable
#define ETHERNET_MAC_HW_FEATURE1_PTOEN  0x1000U      // PTP Offload Enable
#define ETHERNET_MAC_HW_FEATURE1_ADVTHWORD  0x2000U      // IEEE 1588 High Word Register
                                               // Enable
#define ETHERNET_MAC_HW_FEATURE1_ADDR64_S  14U
#define ETHERNET_MAC_HW_FEATURE1_ADDR64_M  0xC000U      // Address Width.

#define ETHERNET_MAC_HW_FEATURE1_DCBEN  0x10000U     // DCB Feature Enable
#define ETHERNET_MAC_HW_FEATURE1_SPHEN  0x20000U     // Split Header Feature Enable
#define ETHERNET_MAC_HW_FEATURE1_TSOEN  0x40000U     // TCP Segmentation Offload
                                               // Enable
#define ETHERNET_MAC_HW_FEATURE1_DBGMEMA  0x80000U     // DMA Debug Registers Enable
#define ETHERNET_MAC_HW_FEATURE1_AVSEL  0x100000U    // AV Feature Enable
#define ETHERNET_MAC_HW_FEATURE1_RAVSEL  0x200000U    // Rx Side Only AV Feature
                                               // Enable
#define ETHERNET_MAC_HW_FEATURE1_POUOST  0x800000U    // One Step for PTP over UDP/IP
                                               // Feature Enable
#define ETHERNET_MAC_HW_FEATURE1_HASHTBLSZ_S  24U
#define ETHERNET_MAC_HW_FEATURE1_HASHTBLSZ_M  0x3000000U   // Hash Table Size
#define ETHERNET_MAC_HW_FEATURE1_L3L4FNUM_S  27U
#define ETHERNET_MAC_HW_FEATURE1_L3L4FNUM_M  0x78000000U  // Total number of L3 or L4
                                               // Filters

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_HW_FEATURE2 register
//
//*****************************************************************************
#define ETHERNET_MAC_HW_FEATURE2_RXQCNT_S  0U
#define ETHERNET_MAC_HW_FEATURE2_RXQCNT_M  0xFU         // Number of MTL Receive Queues
#define ETHERNET_MAC_HW_FEATURE2_TXQCNT_S  6U
#define ETHERNET_MAC_HW_FEATURE2_TXQCNT_M  0x3C0U       // Number of MTL Transmit Queues
#define ETHERNET_MAC_HW_FEATURE2_RXCHCNT_S  12U
#define ETHERNET_MAC_HW_FEATURE2_RXCHCNT_M  0xF000U      // Number of DMA Receive
                                               // Channels
#define ETHERNET_MAC_HW_FEATURE2_TXCHCNT_S  18U
#define ETHERNET_MAC_HW_FEATURE2_TXCHCNT_M  0x3C0000U    // Number of DMA Transmit
                                               // Channels
#define ETHERNET_MAC_HW_FEATURE2_PPSOUTNUM_S  24U
#define ETHERNET_MAC_HW_FEATURE2_PPSOUTNUM_M  0x7000000U   // Number of PPS Outputs
#define ETHERNET_MAC_HW_FEATURE2_AUXSNAPNUM_S  28U
#define ETHERNET_MAC_HW_FEATURE2_AUXSNAPNUM_M  0x70000000U  // Number of Auxiliary Snapshot
                                               // Inputs

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_HW_FEATURE3 register
//
//*****************************************************************************
#define ETHERNET_MAC_HW_FEATURE3_NRVF_S  0U
#define ETHERNET_MAC_HW_FEATURE3_NRVF_M  0x7U         // Number of Extended VLAN Tag
                                               // Filters Enabled
#define ETHERNET_MAC_HW_FEATURE3_CBTISEL  0x10U        // Queue/Channel based VLAN tag
                                               // insertion on Tx Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_MDIO_ADDRESS register
//
//*****************************************************************************
#define ETHERNET_MAC_MDIO_ADDRESS_GB  0x1U         // GMII Busy
#define ETHERNET_MAC_MDIO_ADDRESS_C45E  0x2U         // Clause 45 PHY Enable
#define ETHERNET_MAC_MDIO_ADDRESS_GOC_0  0x4U         // GMII Operation Command 0
#define ETHERNET_MAC_MDIO_ADDRESS_GOC_1  0x8U         // GMII Operation Command 1
#define ETHERNET_MAC_MDIO_ADDRESS_SKAP  0x10U        // Skip Address Packet
#define ETHERNET_MAC_MDIO_ADDRESS_CR_S  8U
#define ETHERNET_MAC_MDIO_ADDRESS_CR_M  0xF00U       // CSR Clock Range
#define ETHERNET_MAC_MDIO_ADDRESS_NTC_S  12U
#define ETHERNET_MAC_MDIO_ADDRESS_NTC_M  0x7000U      // Number of Training Clocks
#define ETHERNET_MAC_MDIO_ADDRESS_RDA_S  16U
#define ETHERNET_MAC_MDIO_ADDRESS_RDA_M  0x1F0000U    // Register/Device Address
#define ETHERNET_MAC_MDIO_ADDRESS_PA_S  21U
#define ETHERNET_MAC_MDIO_ADDRESS_PA_M  0x3E00000U   // Physical Layer Address
#define ETHERNET_MAC_MDIO_ADDRESS_BTB  0x4000000U   // Back to Back transactions
#define ETHERNET_MAC_MDIO_ADDRESS_PSE  0x8000000U   // Preamble Suppression Enable

