TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_MDIO_DATA register
//
//*****************************************************************************
#define ETHERNET_MAC_MDIO_DATA_GD_S   0U
#define ETHERNET_MAC_MDIO_DATA_GD_M   0xFFFFU      // GMII Data
#define ETHERNET_MAC_MDIO_DATA_RA_S   16U
#define ETHERNET_MAC_MDIO_DATA_RA_M   0xFFFF0000U  // Register Address

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_ADDRESS0_HIGH register
//
//*****************************************************************************
#define ETHERNET_MAC_ADDRESS0_HIGH_ADDRHI_S  0U
#define ETHERNET_MAC_ADDRESS0_HIGH_ADDRHI_M  0xFFFFU      // MAC Address0[47:32]
#define ETHERNET_MAC_ADDRESS0_HIGH_DCS  0x10000U     // DMA Channel Select
#define ETHERNET_MAC_ADDRESS0_HIGH_AE  0x80000000U  // Address Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_ADDRESS1_HIGH register
//
//*****************************************************************************
#define ETHERNET_MAC_ADDRESS1_HIGH_ADDRHI_S  0U
#define ETHERNET_MAC_ADDRESS1_HIGH_ADDRHI_M  0xFFFFU      // MAC Address1 [47:32]
#define ETHERNET_MAC_ADDRESS1_HIGH_DCS  0x10000U     // DMA Channel Select
#define ETHERNET_MAC_ADDRESS1_HIGH_MBC_S  24U
#define ETHERNET_MAC_ADDRESS1_HIGH_MBC_M  0x3F000000U  // Mask Byte Control
#define ETHERNET_MAC_ADDRESS1_HIGH_SA  0x40000000U  // Source Address
#define ETHERNET_MAC_ADDRESS1_HIGH_AE  0x80000000U  // Address Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_ADDRESS2_HIGH register
//
//*****************************************************************************
#define ETHERNET_MAC_ADDRESS2_HIGH_ADDRHI_S  0U
#define ETHERNET_MAC_ADDRESS2_HIGH_ADDRHI_M  0xFFFFU      // MAC Address1 [47:32]
#define ETHERNET_MAC_ADDRESS2_HIGH_DCS  0x10000U     // DMA Channel Select
#define ETHERNET_MAC_ADDRESS2_HIGH_MBC_S  24U
#define ETHERNET_MAC_ADDRESS2_HIGH_MBC_M  0x3F000000U  // Mask Byte Control
#define ETHERNET_MAC_ADDRESS2_HIGH_SA  0x40000000U  // Source Address
#define ETHERNET_MAC_ADDRESS2_HIGH_AE  0x80000000U  // Address Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_ADDRESS3_HIGH register
//
//*****************************************************************************
#define ETHERNET_MAC_ADDRESS3_HIGH_ADDRHI_S  0U
#define ETHERNET_MAC_ADDRESS3_HIGH_ADDRHI_M  0xFFFFU      // MAC Address1 [47:32]
#define ETHERNET_MAC_ADDRESS3_HIGH_DCS  0x10000U     // DMA Channel Select
#define ETHERNET_MAC_ADDRESS3_HIGH_MBC_S  24U
#define ETHERNET_MAC_ADDRESS3_HIGH_MBC_M  0x3F000000U  // Mask Byte Control
#define ETHERNET_MAC_ADDRESS3_HIGH_SA  0x40000000U  // Source Address
#define ETHERNET_MAC_ADDRESS3_HIGH_AE  0x80000000U  // Address Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MMC_CONTROL_CNTRST   0x1U         // Counters Reset
#define ETHERNET_MMC_CONTROL_CNTSTOPRO  0x2U         // Counter Stop Rollover
#define ETHERNET_MMC_CONTROL_RSTONRD  0x4U         // Reset on Read
#define ETHERNET_MMC_CONTROL_CNTFREEZ  0x8U         // MMC Counter Freeze
#define ETHERNET_MMC_CONTROL_CNTPRST  0x10U        // Counters Preset
#define ETHERNET_MMC_CONTROL_CNTPRSTLVL  0x20U        // Full-Half Preset
#define ETHERNET_MMC_CONTROL_UCDBC    0x100U       // Update MMC Counters for
                                               // Dropped Broadcast Packets

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_RX_INTERRUPT register
//
//*****************************************************************************
#define ETHERNET_MMC_RX_INTERRUPT_RXGBPKTIS  0x1U         // MMC Receive Good Bad Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXGBOCTIS  0x2U         // MMC Receive Good Bad Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXGOCTIS  0x4U         // MMC Receive Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXBCGPIS  0x8U         // MMC Receive Broadcast Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXMCGPIS  0x10U        // MMC Receive Multicast Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXCRCERPIS  0x20U        // MMC Receive CRC Error Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXALGNERPIS  0x40U        // MMC Receive Alignment Error
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXRUNTPIS  0x80U        // MMC Receive Runt Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXJABERPIS  0x100U       // MMC Receive Jabber Error
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXUSIZEGPIS  0x200U       // MMC Receive Undersize Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXOSIZEGPIS  0x400U       // MMC Receive Oversize Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RX64OCTGBPIS  0x800U       // MMC Receive 64 Octet Good Bad
                                               // Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_RX_INTERRUPT_RX65T127OCTGBPIS  0x1000U      // MMC Receive 65 to 127 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RX128T255OCTGBPIS  0x2000U      // MMC Receive 128 to 255 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RX256T511OCTGBPIS  0x4000U      // MMC Receive 256 to 511 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS  0x8000U      // MMC Receive 512 to 1023 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS  0x10000U     // MMC Receive 1024 to Maximum
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXUCGPIS  0x20000U     // MMC Receive Unicast Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXLENERPIS  0x40000U     // MMC Receive Length Error
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXORANGEPIS  0x80000U     // MMC Receive Out Of Range
                                               // Error Packet Counter Interrupt
                                               // Status.
#define ETHERNET_MMC_RX_INTERRUPT_RXPAUSPIS  0x100000U    // MMC Receive Pause Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXFOVPIS  0x200000U    // MMC Receive FIFO Overflow
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXVLANGBPIS  0x400000U    // MMC Receive VLAN Good Bad
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXWDOGPIS  0x800000U    // MMC Receive Watchdog Error
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXRCVERRPIS  0x1000000U   // MMC Receive Error Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXCTRLPIS  0x2000000U   // MMC Receive Control Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_RX_INTERRUPT_RXLPIUSCIS  0x4000000U   // MMC Receive LPI microsecond
                                               // counter interrupt status
#define ETHERNET_MMC_RX_INTERRUPT_RXLPITRCIS  0x8000000U   // MMC Receive LPI transition
                                               // counter interrupt status

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_TX_INTERRUPT register
//
//*****************************************************************************
#define ETHERNET_MMC_TX_INTERRUPT_TXGBOCTIS  0x1U         // MMC Transmit Good Bad Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXGBPKTIS  0x2U         // MMC Transmit Good Bad Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXBCGPIS  0x4U         // MMC Transmit Broadcast Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXMCGPIS  0x8U         // MMC Transmit Multicast Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TX64OCTGBPIS  0x10U        // MMC Transmit 64 Octet Good
                                               // Bad Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TX65T127OCTGBPIS  0x20U        // MMC Transmit 65 to 127 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TX128T255OCTGBPIS  0x40U        // MMC Transmit 128 to 255 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TX256T511OCTGBPIS  0x80U        // MMC Transmit 256 to 511 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS  0x100U       // MMC Transmit 512 to 1023
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS  0x200U       // MMC Transmit 1024 to Maximum
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXUCGBPIS  0x400U       // MMC Transmit Unicast Good Bad
                                               // Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXMCGBPIS  0x800U       // MMC Transmit Multicast Good
                                               // Bad Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXBCGBPIS  0x1000U      // MMC Transmit Broadcast Good
                                               // Bad Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXUFLOWERPIS  0x2000U      // MMC Transmit Underflow Error
                                               // Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXSCOLGPIS  0x4000U      // MMC Transmit Single Collision
                                               // Good Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXMCOLGPIS  0x8000U      // MMC Transmit Multiple
                                               // Collision Good Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXDEFPIS  0x10000U     // MMC Transmit Deferred Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXLATCOLPIS  0x20000U     // MMC Transmit Late Collision
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXEXCOLPIS  0x40000U     // MMC Transmit Excessive
                                               // Collision Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXCARERPIS  0x80000U     // MMC Transmit Carrier Error
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXGOCTIS  0x100000U    // MMC Transmit Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXGPKTIS  0x200000U    // MMC Transmit Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXEXDEFPIS  0x400000U    // MMC Transmit Excessive
                                               // Deferral Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_TX_INTERRUPT_TXPAUSPIS  0x800000U    // MMC Transmit Pause Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXVLANGPIS  0x1000000U   // MMC Transmit VLAN Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXOSIZEGPIS  0x2000000U   // MMC Transmit Oversize Good
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_TX_INTERRUPT_TXLPIUSCIS  0x4000000U   // MMC Transmit LPI microsecond
                                               // counter interrupt status
#define ETHERNET_MMC_TX_INTERRUPT_TXLPITRCIS  0x8000000U   // MMC Transmit LPI transition
                                               // counter interrupt status

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_RX_INTERRUPT_MASK register
//
//*****************************************************************************
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXGBPKTIM  0x1U         // MMC Receive Good Bad Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXGBOCTIM  0x2U         // MMC Receive Good Bad Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXGOCTIM  0x4U         // MMC Receive Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXBCGPIM  0x8U         // MMC Receive Broadcast Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXMCGPIM  0x10U        // MMC Receive Multicast Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXCRCERPIM  0x20U        // MMC Receive CRC Error Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXALGNERPIM  0x40U        // MMC Receive Alignment Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXRUNTPIM  0x80U        // MMC Receive Runt Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXJABERPIM  0x100U       // MMC Receive Jabber Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM  0x200U       // MMC Receive Undersize Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM  0x400U       // MMC Receive Oversize Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM  0x800U       // MMC Receive 64 Octet Good Bad
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM  0x1000U      // MMC Receive 65 to 127 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM  0x2000U      // MMC Receive 128 to 255 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM  0x4000U      // MMC Receive 256 to 511 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM  0x8000U      // MMC Receive 512 to 1023 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM  0x10000U     // MMC Receive 1024 to Maximum
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Mask.
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXUCGPIM  0x20000U     // MMC Receive Unicast Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXLENERPIM  0x40000U     // MMC Receive Length Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXORANGEPIM  0x80000U     // MMC Receive Out Of Range
                                               // Error Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXPAUSPIM  0x100000U    // MMC Receive Pause Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXFOVPIM  0x200000U    // MMC Receive FIFO Overflow
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM  0x400000U    // MMC Receive VLAN Good Bad
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXWDOGPIM  0x800000U    // MMC Receive Watchdog Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM  0x1000000U   // MMC Receive Error Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXCTRLPIM  0x2000000U   // MMC Receive Control Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM  0x4000000U   // MMC Receive LPI microsecond
                                               // counter interrupt Mask
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXLPITRCIM  0x8000000U   // MMC Receive LPI transition
                                               // counter interrupt Mask

