TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_TX_INTERRUPT_MASK register
//
//*****************************************************************************
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXGBOCTIM  0x1U         // MMC Transmit Good Bad Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXGBPKTIM  0x2U         // MMC Transmit Good Bad Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXBCGPIM  0x4U         // MMC Transmit Broadcast Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXMCGPIM  0x8U         // MMC Transmit Multicast Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM  0x10U        // MMC Transmit 64 Octet Good
                                               // Bad Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM  0x20U        // MMC Transmit 65 to 127 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM  0x40U        // MMC Transmit 128 to 255 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM  0x80U        // MMC Transmit 256 to 511 Octet
                                               // Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM  0x100U       // MMC Transmit 512 to 1023
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM  0x200U       // MMC Transmit 1024 to Maximum
                                               // Octet Good Bad Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXUCGBPIM  0x400U       // MMC Transmit Unicast Good Bad
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXMCGBPIM  0x800U       // MMC Transmit Multicast Good
                                               // Bad Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXBCGBPIM  0x1000U      // MMC Transmit Broadcast Good
                                               // Bad Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM  0x2000U      // MMC Transmit Underflow Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM  0x4000U      // MMC Transmit Single Collision
                                               // Good Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM  0x8000U      // MMC Transmit Multiple
                                               // Collision Good Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXDEFPIM  0x10000U     // MMC Transmit Deferred Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM  0x20000U     // MMC Transmit Late Collision
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM  0x40000U     // MMC Transmit Excessive
                                               // Collision Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXCARERPIM  0x80000U     // MMC Transmit Carrier Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXGOCTIM  0x100000U    // MMC Transmit Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXGPKTIM  0x200000U    // MMC Transmit Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM  0x400000U    // MMC Transmit Excessive
                                               // Deferral Packet Counter Interrupt
                                               // Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXPAUSPIM  0x800000U    // MMC Transmit Pause Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXVLANGPIM  0x1000000U   // MMC Transmit VLAN Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM  0x2000000U   // MMC Transmit Oversize Good
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM  0x4000000U   // MMC Transmit LPI microsecond
                                               // counter interrupt Mask
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXLPITRCIM  0x8000000U   // MMC Transmit LPI transition
                                               // counter interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_IPC_RX_INTERRUPT_MASK register
//
//*****************************************************************************
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GPIM  0x1U         // MMC Receive IPV4 Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HERPIM  0x2U         // MMC Receive IPV4 Header Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYPIM  0x4U         // MMC Receive IPV4 No Payload
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGPIM  0x8U         // MMC Receive IPV4 Fragmented
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLPIM  0x10U        // MMC Receive IPV4 UDP Checksum
                                               // Disabled Packet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GPIM  0x20U        // MMC Receive IPV6 Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HERPIM  0x40U        // MMC Receive IPV6 Header Error
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYPIM  0x80U        // MMC Receive IPV6 No Payload
                                               // Packet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGPIM  0x100U       // MMC Receive UDP Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPERPIM  0x200U       // MMC Receive UDP Error Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGPIM  0x400U       // MMC Receive TCP Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPERPIM  0x800U       // MMC Receive TCP Error Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGPIM  0x1000U      // MMC Receive ICMP Good Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPERPIM  0x2000U      // MMC Receive ICMP Error Packet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GOIM  0x10000U     // MMC Receive IPV4 Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HEROIM  0x20000U     // MMC Receive IPV4 Header Error
                                               // Octet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYOIM  0x40000U     // MMC Receive IPV4 No Payload
                                               // Octet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGOIM  0x80000U     // MMC Receive IPV4 Fragmented
                                               // Octet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLOIM  0x100000U    // MMC Receive IPV4 UDP Checksum
                                               // Disabled Octet Counter
                                               // Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GOIM  0x200000U    // MMC Receive IPV6 Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HEROIM  0x400000U    // MMC Receive IPV6 Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYOIM  0x800000U    // MMC Receive IPV6 Header Error
                                               // Octet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGOIM  0x1000000U   // MMC Receive IPV6 No Payload
                                               // Octet Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPEROIM  0x2000000U   // MMC Receive UDP Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGOIM  0x4000000U   // MMC Receive TCP Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPEROIM  0x8000000U   // MMC Receive TCP Error Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGOIM  0x10000000U  // MMC Receive ICMP Good Octet
                                               // Counter Interrupt Mask
#define ETHERNET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPEROIM  0x20000000U  // MMC Receive ICMP Error Octet
                                               // Counter Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the MMC_IPC_RX_INTERRUPT register
//
//*****************************************************************************
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4GPIS  0x1U         // MMC Receive IPV4 Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4HERPIS  0x2U         // MMC Receive IPV4 Header Error
                                               // Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYPIS  0x4U         // MMC Receive IPV4 No Payload
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGPIS  0x8U         // MMC Receive IPV4 Fragmented
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLPIS  0x10U        // MMC Receive IPV4 UDP Checksum
                                               // Disabled Packet Counter
                                               // Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6GPIS  0x20U        // MMC Receive IPV6 Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6HERPIS  0x40U        // MMC Receive IPV6 Header Error
                                               // Packet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYPIS  0x80U        // MMC Receive IPV6 No Payload
                                               // Packet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXUDPGPIS  0x100U       // MC Receive UDP Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXUDPERPIS  0x200U       // MMC Receive UDP Error Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXTCPGPIS  0x400U       // MMC Receive TCP Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXTCPERPIS  0x800U       // MMC Receive TCP Error Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXICMPGPIS  0x1000U      // MMC Receive ICMP Good Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXICMPERPIS  0x2000U      // MMC Receive ICMP Error Packet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4GOIS  0x10000U     // MMC Receive IPV4 Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4HEROIS  0x20000U     // MMC Receive IPV4 Header Error
                                               // Octet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYOIS  0x40000U     // MMC Receive IPV4 No Payload
                                               // Octet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGOIS  0x80000U     // MMC Receive IPV4 Fragmented
                                               // Octet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLOIS  0x100000U    // MMC Receive IPV4 UDP Checksum
                                               // Disabled Octet Counter
                                               // Interrupt
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6GOIS  0x200000U    // MMC Receive IPV6 Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6HEROIS  0x400000U    // MMC Receive IPV6 Header Error
                                               // Octet Counter Interrupt
                                               // Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYOIS  0x800000U    // MMC Receive IPV6 No Payload
                                               // Octet Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXUDPGOIS  0x1000000U   // MMC Receive UDP Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXUDPEROIS  0x2000000U   // MMC Receive UDP Error Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXTCPGOIS  0x4000000U   // MMC Receive TCP Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXTCPEROIS  0x8000000U   // MMC Receive TCP Error Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXICMPGOIS  0x10000000U  // MMC Receive ICMP Good Octet
                                               // Counter Interrupt Status
#define ETHERNET_MMC_IPC_RX_INTERRUPT_RXICMPEROIS  0x20000000U  // MMC Receive ICMP Error Octet
                                               // Counter Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_L3_L4_CONTROL0 register
//
//*****************************************************************************
#define ETHERNET_MAC_L3_L4_CONTROL0_L3PEN0  0x1U         // Layer 3 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L3PEN0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3PEN0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAM0  0x4U         // Layer 3 IP SA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAIM0  0x8U         // Layer 3 IP SA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAIM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3SAIM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAM0  0x10U        // Layer 3 IP DA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAIM0  0x20U        // Layer 3 IP DA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAIM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3DAIM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3HSBM0_S  6U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3HSBM0_M  0x7C0U       // Layer 3 IP SA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL0_L3HDBM0_S  11U
#define ETHERNET_MAC_L3_L4_CONTROL0_L3HDBM0_M  0xF800U      // Layer 3 IP DA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL0_L4PEN0  0x10000U     // Layer 4 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L4PEN0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4PEN0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPM0  0x40000U     // Layer 4 Source Port Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPIM0  0x80000U     // Layer 4 Source Port Inverse
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPIM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4SPIM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPM0  0x100000U    // Layer 4 Destination Port
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPIM0  0x200000U    // Layer 4 Destination Port
                                               // Inverse Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPIM0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_L4DPIM0_ENABLE  0x1U
#define ETHERNET_MAC_L3_L4_CONTROL0_DMCHN0  0x1000000U   // DMA Channel Number 
#define ETHERNET_MAC_L3_L4_CONTROL0_DMCHEN0  0x10000000U  // DMA Channel Select Enable
#define ETHERNET_MAC_L3_L4_CONTROL0_DMCHEN0_DISABLE  0x0U
#define ETHERNET_MAC_L3_L4_CONTROL0_DMCHEN0_ENABLE  0x1U


//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LAYER4_ADDRESS0 register
//
//*****************************************************************************
#define ETHERNET_MAC_LAYER4_ADDRESS0_L4SP0_S  0U
#define ETHERNET_MAC_LAYER4_ADDRESS0_L4SP0_M  0xFFFFU      // Layer 4 Source Port Number
                                               // Field
#define ETHERNET_MAC_LAYER4_ADDRESS0_L4DP0_S  16U
#define ETHERNET_MAC_LAYER4_ADDRESS0_L4DP0_M  0xFFFF0000U  // Layer 4 Destination Port
                                               // Number Field

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_L3_L4_CONTROL1 register
//
//*****************************************************************************
#define ETHERNET_MAC_L3_L4_CONTROL1_L3PEN1  0x1U         // Layer 3 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L3SAM1  0x4U         // Layer 3 IP SA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L3SAIM1  0x8U         // Layer 3 IP SA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L3DAM1  0x10U        // Layer 3 IP DA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L3DAIM1  0x20U        // Layer 3 IP DA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L3HSBM1_S  6U
#define ETHERNET_MAC_L3_L4_CONTROL1_L3HSBM1_M  0x7C0U       // Layer 3 IP SA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL1_L3HDBM1_S  11U
#define ETHERNET_MAC_L3_L4_CONTROL1_L3HDBM1_M  0xF800U      // Layer 3 IP DA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL1_L4PEN1  0x10000U     // Layer 4 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L4SPM1  0x40000U     // Layer 4 Source Port Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L4SPIM1  0x80000U     // Layer 4 Source Port Inverse
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L4DPM1  0x100000U    // Layer 4 Destination Port
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_L4DPIM1  0x200000U    // Layer 4 Destination Port
                                               // Inverse Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL1_DMCHN1  0x1000000U   // DMA Channel Number
#define ETHERNET_MAC_L3_L4_CONTROL1_DMCHEN1  0x10000000U  // DMA Channel Select Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LAYER4_ADDRESS1 register
//
//*****************************************************************************
#define ETHERNET_MAC_LAYER4_ADDRESS1_L4SP1_S  0U
#define ETHERNET_MAC_LAYER4_ADDRESS1_L4SP1_M  0xFFFFU      // Layer 4 Source Port Number
                                               // Field
#define ETHERNET_MAC_LAYER4_ADDRESS1_L4DP1_S  16U
#define ETHERNET_MAC_LAYER4_ADDRESS1_L4DP1_M  0xFFFF0000U  // Layer 4 Destination Port
                                               // Number Field

