TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_L3_L4_CONTROL2 register
//
//*****************************************************************************
#define ETHERNET_MAC_L3_L4_CONTROL2_L3PEN2  0x1U         // Layer 3 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L3SAM2  0x4U         // Layer 3 IP SA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L3SAIM2  0x8U         // Layer 3 IP SA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L3DAM2  0x10U        // Layer 3 IP DA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L3DAIM2  0x20U        // Layer 3 IP DA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L3HSBM2_S  6U
#define ETHERNET_MAC_L3_L4_CONTROL2_L3HSBM2_M  0x7C0U       // Layer 3 IP SA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL2_L3HDBM2_S  11U
#define ETHERNET_MAC_L3_L4_CONTROL2_L3HDBM2_M  0xF800U      // Layer 3 IP DA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL2_L4PEN2  0x10000U     // Layer 4 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L4SPM2  0x40000U     // Layer 4 Source Port Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L4SPIM2  0x80000U     // Layer 4 Source Port Inverse
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L4DPM2  0x100000U    // Layer 4 Destination Port
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_L4DPIM2  0x200000U    // Layer 4 Destination Port
                                               // Inverse Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL2_DMCHN2  0x1000000U   // DMA Channel Number
#define ETHERNET_MAC_L3_L4_CONTROL2_DMCHEN2  0x10000000U  // DMA Channel Select Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LAYER4_ADDRESS2 register
//
//*****************************************************************************
#define ETHERNET_MAC_LAYER4_ADDRESS2_L4SP2_S  0U
#define ETHERNET_MAC_LAYER4_ADDRESS2_L4SP2_M  0xFFFFU      // Layer 4 Source Port Number
                                               // Field
#define ETHERNET_MAC_LAYER4_ADDRESS2_L4DP2_S  16U
#define ETHERNET_MAC_LAYER4_ADDRESS2_L4DP2_M  0xFFFF0000U  // Layer 4 Destination Port
                                               // Number Field

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_L3_L4_CONTROL3 register
//
//*****************************************************************************
#define ETHERNET_MAC_L3_L4_CONTROL3_L3PEN3  0x1U         // Layer 3 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L3SAM3  0x4U         // Layer 3 IP SA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L3SAIM3  0x8U         // Layer 3 IP SA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L3DAM3  0x10U        // Layer 3 IP DA Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L3DAIM3  0x20U        // Layer 3 IP DA Inverse Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L3HSBM3_S  6U
#define ETHERNET_MAC_L3_L4_CONTROL3_L3HSBM3_M  0x7C0U       // Layer 3 IP SA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL3_L3HDBM3_S  11U
#define ETHERNET_MAC_L3_L4_CONTROL3_L3HDBM3_M  0xF800U      // Layer 3 IP DA Higher Bits
                                               // Match
#define ETHERNET_MAC_L3_L4_CONTROL3_L4PEN3  0x10000U     // Layer 4 Protocol Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L4SPM3  0x40000U     // Layer 4 Source Port Match
                                               // Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L4SPIM3  0x80000U     // Layer 4 Source Port Inverse
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L4DPM3  0x100000U    // Layer 4 Destination Port
                                               // Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_L4DPIM3  0x200000U    // Layer 4 Destination Port
                                               // Inverse Match Enable
#define ETHERNET_MAC_L3_L4_CONTROL3_DMCHN3  0x1000000U   // DMA Channel Number
#define ETHERNET_MAC_L3_L4_CONTROL3_DMCHEN3  0x10000000U  // DMA Channel Select Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LAYER4_ADDRESS3 register
//
//*****************************************************************************
#define ETHERNET_MAC_LAYER4_ADDRESS3_L4SP3_S  0U
#define ETHERNET_MAC_LAYER4_ADDRESS3_L4SP3_M  0xFFFFU      // Layer 4 Source Port Number
                                               // Field
#define ETHERNET_MAC_LAYER4_ADDRESS3_L4DP3_S  16U
#define ETHERNET_MAC_LAYER4_ADDRESS3_L4DP3_M  0xFFFF0000U  // Layer 4 Destination Port
                                               // Number Field

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_TIMESTAMP_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSENA  0x1U         // Enable Timestamp
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSCFUPDT  0x2U         // Fine or Coarse Timestamp
                                               // Update
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSINIT  0x4U         // Initialize Timestamp
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSUPDT  0x8U         // Update Timestamp
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSTRIG  0x10U        // Enable Timestamp Interrupt
                                               // Trigger
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSADDREG  0x20U        // Update Addend Register
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSENALL  0x100U       // Enable Timestamp for All
                                               // Packets
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR  0x200U       // Timestamp Digital or Binary
                                               // Rollover Control
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSVER2ENA  0x400U       // Enable PTP Packet Processing
                                               // for Version 2 Format
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSIPENA  0x800U       // Enable Processing of PTP over
                                               // Ethernet Packets
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSIPV6ENA  0x1000U      // Enable Processing of PTP
                                               // Packets Sent over IPv6-UDP
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSIPV4ENA  0x2000U      // Enable Processing of PTP
                                               // Packets Sent over IPv4-UDP
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSEVNTENA  0x4000U      // Enable Timestamp Snapshot for
                                               // Event Messages
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSMSTRENA  0x8000U      // Enable Snapshot for Messages
                                               // Relevant to Master
#define ETHERNET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_S  16U
#define ETHERNET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_M  0x30000U     // Select PTP packets for Taking
                                               // Snapshots
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TSENMACADDR  0x40000U     // Enable MAC Address for PTP
                                               // Packet Filtering
#define ETHERNET_MAC_TIMESTAMP_CONTROL_CSC  0x80000U     // Enable checksum correction
                                               // during OST for PTP over UDP/IPv4
                                               // packets
#define ETHERNET_MAC_TIMESTAMP_CONTROL_ESTI  0x100000U    // External System Time Input
#define ETHERNET_MAC_TIMESTAMP_CONTROL_TXTSSTSM  0x1000000U   // Transmit Timestamp Status
                                               // Mode
#define ETHERNET_MAC_TIMESTAMP_CONTROL_AV8021ASMEN  0x10000000U  // AV 802.1AS Mode Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_SUB_SECOND_INCREMENT register
//
//*****************************************************************************
#define ETHERNET_MAC_SUB_SECOND_INCREMENT_SNSINC_S  8U
#define ETHERNET_MAC_SUB_SECOND_INCREMENT_SNSINC_M  0xFF00U      // Sub-nanosecond Increment
                                               // Value
#define ETHERNET_MAC_SUB_SECOND_INCREMENT_SSINC_S  16U
#define ETHERNET_MAC_SUB_SECOND_INCREMENT_SSINC_M  0xFF0000U    // Sub-second Increment Value

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_SYSTEM_TIME_NANOSECONDS register
//
//*****************************************************************************
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_S  0U
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_M  0x7FFFFFFFU  // Timestamp Sub Seconds

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_SYSTEM_TIME_NANOSECONDS_UPDATE register
//
//*****************************************************************************
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_S  0U
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_M  0x7FFFFFFFU  // Timestamp Sub Seconds
#define ETHERNET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB  0x80000000U  // Add or Subtract Time

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS register
//
//*****************************************************************************
#define ETHERNET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_S  0U
#define ETHERNET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_M  0xFFFFU      // Timestamp Higher Word
                                               // Register

//*****************************************************************************
// The following are defines for the bit fields in the MAC_TIMESTAMP_STATUS register
//
//*****************************************************************************
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSSOVF  0x1U         // Timestamp Seconds Overflow
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTARGT0  0x2U         // Timestamp Target Time Reached
#define ETHERNET_MAC_TIMESTAMP_STATUS_AUXTSTRIG  0x4U         // Auxiliary Timestamp Trigger
                                               // Snapshot
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTRGTERR0  0x8U         // Timestamp Target Time Error
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTARGT1  0x10U        // Timestamp Target Time Reached
                                               // for Target Time PPS1
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTRGTERR1  0x20U        // Timestamp Target Time Error
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTARGT2  0x40U        // Timestamp Target Time Reached
                                               // for Target Time PPS2
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTRGTERR2  0x80U        // Timestamp Target Time Error
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTARGT3  0x100U       // Timestamp Target Time Reached
                                               // for Target Time PPS3
#define ETHERNET_MAC_TIMESTAMP_STATUS_TSTRGTERR3  0x200U       // Timestamp Target Time Error
#define ETHERNET_MAC_TIMESTAMP_STATUS_TXTSSIS  0x8000U      // Tx Timestamp Status Interrupt
                                               // Status
#define ETHERNET_MAC_TIMESTAMP_STATUS_ATSSTN_S  16U
#define ETHERNET_MAC_TIMESTAMP_STATUS_ATSSTN_M  0xF0000U     // Auxiliary Timestamp Snapshot
                                               // Trigger Identifier
#define ETHERNET_MAC_TIMESTAMP_STATUS_ATSSTM  0x1000000U   // Auxiliary Timestamp Snapshot
                                               // Trigger Missed
#define ETHERNET_MAC_TIMESTAMP_STATUS_ATSNS_S  25U
#define ETHERNET_MAC_TIMESTAMP_STATUS_ATSNS_M  0x3E000000U  // Number of Auxiliary Timestamp
                                               // Snapshots

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_TX_TIMESTAMP_STATUS_NANOSECONDS register
//
//*****************************************************************************
#define ETHERNET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_S  0U
#define ETHERNET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_M  0x7FFFFFFFU  // Transmit Timestamp Status Low
#define ETHERNET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS  0x80000000U  // Transmit Timestamp Status
                                               // Missed

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_AUXILIARY_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MAC_AUXILIARY_CONTROL_ATSFC  0x1U         // Auxiliary Snapshot FIFO Clear
#define ETHERNET_MAC_AUXILIARY_CONTROL_ATSEN0  0x10U        // Auxiliary Snapshot 0 Enable
#define ETHERNET_MAC_AUXILIARY_CONTROL_ATSEN1  0x20U        // Auxiliary Snapshot 1 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_AUXILIARY_TIMESTAMP_NANOSECONDS register
//
//*****************************************************************************
#define ETHERNET_MAC_AUXILIARY_TIMESTAMP_NANOSECONDS_AUXTSLO_S  0U
#define ETHERNET_MAC_AUXILIARY_TIMESTAMP_NANOSECONDS_AUXTSLO_M  0x7FFFFFFFU  // Auxiliary Timestamp

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC register
//
//*****************************************************************************
#define ETHERNET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_S  8U
#define ETHERNET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_M  0xFF00U      // Timestamp Ingress Correction,
                                               // sub-nanoseconds

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC register
//
//*****************************************************************************
#define ETHERNET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_S  8U
#define ETHERNET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_M  0xFF00U      // Timestamp Egress Correction,
                                               // sub-nanoseconds

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_PPS_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_S  0U
#define ETHERNET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_M  0xFU         // PPS Output Frequency Control

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_PTO_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MAC_PTO_CONTROL_PTOEN  0x1U         // PTP Offload Enable
#define ETHERNET_MAC_PTO_CONTROL_ASYNCEN  0x2U         // Automatic PTP SYNC message
                                               // Enable
#define ETHERNET_MAC_PTO_CONTROL_APDREQEN  0x4U         // Automatic PTP Pdelay_Req
                                               // message Enable
#define ETHERNET_MAC_PTO_CONTROL_ASYNCTRIG  0x10U        // Automatic PTP SYNC message
                                               // Trigger
#define ETHERNET_MAC_PTO_CONTROL_APDREQTRIG  0x20U        // Automatic PTP Pdelay_Req
                                               // message Trigger
#define ETHERNET_MAC_PTO_CONTROL_DRRDIS  0x40U        // Disable PTO Delay
                                               // Request/Response response generation
#define ETHERNET_MAC_PTO_CONTROL_PDRDIS  0x80U        // Reserved
#define ETHERNET_MAC_PTO_CONTROL_DN_S  8U
#define ETHERNET_MAC_PTO_CONTROL_DN_M  0xFF00U      // Domain Number

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_SOURCE_PORT_IDENTITY2 register
//
//*****************************************************************************
#define ETHERNET_MAC_SOURCE_PORT_IDENTITY2_SPI2_S  0U
#define ETHERNET_MAC_SOURCE_PORT_IDENTITY2_SPI2_M  0xFFFFU      // Source Port Identity 2

//*****************************************************************************
//
// The following are defines for the bit fields in the MAC_LOG_MESSAGE_INTERVAL register
//
//*****************************************************************************
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_LSI_S  0U
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_LSI_M  0xFFU        // Log Sync Interval
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_DRSYNCR_S  8U
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_DRSYNCR_M  0x700U       // Delay_Req to SYNC Ratio

#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_LMPDRI_S  24U
#define ETHERNET_MAC_LOG_MESSAGE_INTERVAL_LMPDRI_M  0xFF000000U  // Log Min Pdelay_Req Interval

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_MODE register
//
//*****************************************************************************
#define ETHERNET_DMA_MODE_SWR         0x1U         // Software Reset
#define ETHERNET_DMA_MODE_DA          0x2U         // DMA Tx or Rx Arbitration
                                               // Scheme
#define ETHERNET_DMA_MODE_TAA_S       2U
#define ETHERNET_DMA_MODE_TAA_M       0x1CU        // Transmit Arbitration
                                               // Algorithm
#define ETHERNET_DMA_MODE_TXPR        0x800U       // Transmit Priority
#define ETHERNET_DMA_MODE_PR_S        12U
#define ETHERNET_DMA_MODE_PR_M        0x7000U      // Priority Ratio
#define ETHERNET_DMA_MODE_INTM_S      16U
#define ETHERNET_DMA_MODE_INTM_M      0x30000U     // Interrupt Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SYSBUS_MODE register
//
//*****************************************************************************
#define ETHERNET_DMA_SYSBUS_MODE_FB   0x1U         // Fixed Burst Length
#define ETHERNET_DMA_SYSBUS_MODE_AAL  0x1000U      // Address-Aligned Beats
#define ETHERNET_DMA_SYSBUS_MODE_MB   0x4000U      // Mixed Burst
#define ETHERNET_DMA_SYSBUS_MODE_RB   0x8000U      // Rebuild INCRx Burst

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_INTERRUPT_STATUS register
//
//*****************************************************************************
#define ETHERNET_DMA_INTERRUPT_STATUS_DC0IS  0x1U         // DMA Channel 0 Interrupt
                                               // Status
#define ETHERNET_DMA_INTERRUPT_STATUS_DC1IS  0x2U         // DMA Channel 1 Interrupt
                                               // Status
#define ETHERNET_DMA_INTERRUPT_STATUS_MTLIS  0x10000U     // MTL Interrupt Status
#define ETHERNET_DMA_INTERRUPT_STATUS_MACIS  0x20000U     // MAC Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DEBUG_STATUS0 register
//
//*****************************************************************************
#define ETHERNET_DMA_DEBUG_STATUS0_AXWHSTS  0x1U         // AHB Master Status
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_RSVD  0x2U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_RUN_CRD  0x5U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_RUN_FRTD  0x1U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_RUN_TRP  0x7U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_RUN_WRP  0x3U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_STOP  0x0U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_SUSPND  0x4U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_TSTMP  0x6U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_S  8U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS0_M  0xF00U       // DMA Channel 0 Receive Process
                                               // State
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_RUN_CTD  0x7U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_RUN_FTTD  0x1U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_RUN_RDS  0x3U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_RUN_WS  0x2U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_STOP  0x0U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_SUSPND  0x6U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_TSTMP_WS  0x4U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_S  12U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS0_M  0xF000U      // DMA Channel 0 Transmit
                                               // Process State
#define ETHERNET_DMA_DEBUG_STATUS0_RPS1_S  16U
#define ETHERNET_DMA_DEBUG_STATUS0_RPS1_M  0xF0000U     // DMA Channel 1 Receive Process
                                               // State
#define ETHERNET_DMA_DEBUG_STATUS0_TPS1_S  20U
#define ETHERNET_DMA_DEBUG_STATUS0_TPS1_M  0xF00000U    // DMA Channel 1 Transmit
                                               // Process State

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_CONTROL_MSS_S  0U
#define ETHERNET_DMA_CH0_CONTROL_MSS_M  0x3FFFU      // Maximum Segment Size
#define ETHERNET_DMA_CH0_CONTROL_PBLX8  0x10000U     // 8xPBL mode
#define ETHERNET_DMA_CH0_CONTROL_DSL_S  18U
#define ETHERNET_DMA_CH0_CONTROL_DSL_M  0x1C0000U    // Descriptor Skip Length
#define ETHERNET_DMA_CH0_CONTROL_SPH  0x1000000U   // Split Headers

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_TX_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_TX_CONTROL_ST  0x1U         // Start or Stop Transmission
                                               // Command
#define ETHERNET_DMA_CH0_TX_CONTROL_TCW_S  1U
#define ETHERNET_DMA_CH0_TX_CONTROL_TCW_M  0xEU         // Transmit Channel Weight
#define ETHERNET_DMA_CH0_TX_CONTROL_OSF  0x10U        // Operate on Second Packet
#define ETHERNET_DMA_CH0_TX_CONTROL_TSE  0x1000U      // TCP Segmentation Enabled
#define ETHERNET_DMA_CH0_TX_CONTROL_TXPBL_S  16U
#define ETHERNET_DMA_CH0_TX_CONTROL_TXPBL_M  0x3F0000U    // Transmit Programmable Burst
                                               // Length
#define ETHERNET_DMA_CH0_TX_CONTROL_ETIC  0x400000U    // Early Transmit Interrupt
                                               // Control
#define ETHERNET_DMA_CH0_TX_CONTROL_ETIC_S 22U
#define ETHERNET_DMA_CH0_TX_CONTROL_ETIC_DISABLE  0x0U
#define ETHERNET_DMA_CH0_TX_CONTROL_ETIC_ENABLE  0x1U

#define ETHERNET_DMA_CH0_TX_CONTROL_TSE_M  0x1000U      // TCP Segmentation Enabled

