TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_RX_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_RX_CONTROL_SR  0x1U         // Start or Stop Receive
#define ETHERNET_DMA_CH0_RX_CONTROL_RBSZ_S  3U
#define ETHERNET_DMA_CH0_RX_CONTROL_RBSZ_M  0x7FF8U      // Receive Buffer size
#define ETHERNET_DMA_CH0_RX_CONTROL_RXPBL_S  16U
#define ETHERNET_DMA_CH0_RX_CONTROL_RXPBL_M  0x3F0000U    // Receive Programmable Burst
                                               // Length
#define ETHERNET_DMA_CH0_RX_CONTROL_RPF  0x80000000U  // DMA Rx Channel0 Packet Flush

#define ETHERNET_DMA_CH0_RX_CONTROL_ERIC  0x400000U    // Early Receive Interrupt
                                               // Control
#define ETHERNET_DMA_CH0_TX_CONTROL_ERIC_S 22U

#define ETHERNET_DMA_CH0_RX_CONTROL_ERIC_DISABLE  0x0U
#define ETHERNET_DMA_CH0_RX_CONTROL_ERIC_ENABLE  0x1U



//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_TXDESC_LIST_ADDRESS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_S  2U
#define ETHERNET_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_M  0xFFFFFFFCU  // Start of Transmit List

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_RXDESC_LIST_ADDRESS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_S  2U
#define ETHERNET_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_M  0xFFFFFFFCU  // Start of Receive List

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_TXDESC_TAIL_POINTER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_S  2U
#define ETHERNET_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_M  0xFFFFFFFCU  // Transmit Descriptor Tail
                                               // Pointer

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_RXDESC_TAIL_POINTER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_S  2U
#define ETHERNET_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_M  0xFFFFFFFCU  // Receive Descriptor Tail
                                               // Pointer

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_TXDESC_RING_LENGTH register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_TXDESC_RING_LENGTH_TDRL_S  0U
#define ETHERNET_DMA_CH0_TXDESC_RING_LENGTH_TDRL_M  0x3FFU       // Transmit Descriptor Ring
                                               // Length

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_RXDESC_RING_LENGTH register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_RXDESC_RING_LENGTH_RDRL_S  0U
#define ETHERNET_DMA_CH0_RXDESC_RING_LENGTH_RDRL_M  0x3FFU       // Receive Descriptor Ring
                                               // Length

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_INTERRUPT_ENABLE register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_TIE  0x1U         // Transmit Interrupt Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_TXSE  0x2U         // Transmit Stopped Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_TBUE  0x4U         // Transmit Buffer Unavailable
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_RIE  0x40U        // Receive Interrupt Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_RBUE  0x80U        // Receive Buffer Unavailable
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_RSE  0x100U       // Receive Stopped Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_RWTE  0x200U       // Receive Watchdog Timeout
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_ETIE  0x400U       // Early Transmit Interrupt
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_ERIE  0x800U       // Early Receive Interrupt
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_FBEE  0x1000U      // Fatal Bus Error Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_CDEE  0x2000U      // Context Descriptor Error
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_AIE  0x4000U      // Abnormal Interrupt Summary
                                               // Enable
#define ETHERNET_DMA_CH0_INTERRUPT_ENABLE_NIE  0x8000U      // Normal Interrupt Summary
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_S  0U
#define ETHERNET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_M  0xFFU        // Receive Interrupt Watchdog
                                               // Timer Count
#define ETHERNET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_S  16U
#define ETHERNET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_M  0x30000U     // Receive Interrupt Watchdog
                                               // Timer Count Units

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_STATUS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_STATUS_TI    0x1U         // Transmit Interrupt
#define ETHERNET_DMA_CH0_STATUS_TPS   0x2U         // Transmit Process Stopped
#define ETHERNET_DMA_CH0_STATUS_TBU   0x4U         // Transmit Buffer Unavailable
#define ETHERNET_DMA_CH0_STATUS_RI    0x40U        // Receive Interrupt
#define ETHERNET_DMA_CH0_STATUS_RBU   0x80U        // Receive Buffer Unavailable
#define ETHERNET_DMA_CH0_STATUS_RPS   0x100U       // Receive Process Stopped
#define ETHERNET_DMA_CH0_STATUS_RWT   0x200U       // Receive Watchdog Timeout
#define ETHERNET_DMA_CH0_STATUS_ETI   0x400U       // Early Transmit Interrupt
#define ETHERNET_DMA_CH0_STATUS_ERI   0x800U       // Early Receive Interrupt
#define ETHERNET_DMA_CH0_STATUS_FBE   0x1000U      // Fatal Bus Error
#define ETHERNET_DMA_CH0_STATUS_CDE   0x2000U      // Context Descriptor Error
#define ETHERNET_DMA_CH0_STATUS_AIS   0x4000U      // Abnormal Interrupt Summary
#define ETHERNET_DMA_CH0_STATUS_NIS   0x8000U      // Normal Interrupt Summary
#define ETHERNET_DMA_CH0_STATUS_TEB_S  16U
#define ETHERNET_DMA_CH0_STATUS_TEB_M  0x70000U     // Tx DMA Error Bits
#define ETHERNET_DMA_CH0_STATUS_REB_S  19U
#define ETHERNET_DMA_CH0_STATUS_REB_M  0x380000U    // Rx DMA Error Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH0_MISS_FRAME_CNT register
//
//*****************************************************************************
#define ETHERNET_DMA_CH0_MISS_FRAME_CNT_MFC_S  0U
#define ETHERNET_DMA_CH0_MISS_FRAME_CNT_MFC_M  0x7FFU       // Dropped Packet Counters
#define ETHERNET_DMA_CH0_MISS_FRAME_CNT_MFCO  0x8000U      // Overflow status of the MFC
                                               // Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_CONTROL_PBLX8  0x10000U     // 8xPBL mode
#define ETHERNET_DMA_CH1_CONTROL_DSL_S  18U
#define ETHERNET_DMA_CH1_CONTROL_DSL_M  0x1C0000U    // Descriptor Skip Length
#define ETHERNET_DMA_CH1_CONTROL_SPH  0x1000000U   // Split Headers

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_TX_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_TX_CONTROL_ST  0x1U         // Start or Stop Transmission
                                               // Command
#define ETHERNET_DMA_CH1_TX_CONTROL_TCW_S  1U
#define ETHERNET_DMA_CH1_TX_CONTROL_TCW_M  0xEU         // Transmit Channel Weight
#define ETHERNET_DMA_CH1_TX_CONTROL_OSF  0x10U        // Operate on Second Packet
#define ETHERNET_DMA_CH1_TX_CONTROL_TSE  0x1000U      // TCP Segmentation Enabled
#define ETHERNET_DMA_CH1_TX_CONTROL_TXPBL_S  16U
#define ETHERNET_DMA_CH1_TX_CONTROL_TXPBL_M  0x3F0000U    // Transmit Programmable Burst
                                               // Length

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_RX_CONTROL register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_RX_CONTROL_SR  0x1U         // Start or Stop Receive
#define ETHERNET_DMA_CH1_RX_CONTROL_RBSZ_S  3U
#define ETHERNET_DMA_CH1_RX_CONTROL_RBSZ_M  0x7FF8U      // Receive Buffer size
#define ETHERNET_DMA_CH1_RX_CONTROL_RXPBL_S  16U
#define ETHERNET_DMA_CH1_RX_CONTROL_RXPBL_M  0x3F0000U    // Receive Programmable Burst
                                               // Length
#define ETHERNET_DMA_CH1_RX_CONTROL_RPF  0x80000000U  // DMA Rx Channel0 Packet Flush

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_TXDESC_LIST_ADDRESS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_S  2U
#define ETHERNET_DMA_CH1_TXDESC_LIST_ADDRESS_TDESLA_M  0xFFFFFFFCU  // Start of Transmit List

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_RXDESC_LIST_ADDRESS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_S  2U
#define ETHERNET_DMA_CH1_RXDESC_LIST_ADDRESS_RDESLA_M  0xFFFFFFFCU  // Start of Receive List

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_TXDESC_TAIL_POINTER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_S  2U
#define ETHERNET_DMA_CH1_TXDESC_TAIL_POINTER_TDTP_M  0xFFFFFFFCU  // Transmit Descriptor Tail
                                               // Pointer

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_RXDESC_TAIL_POINTER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_S  2U
#define ETHERNET_DMA_CH1_RXDESC_TAIL_POINTER_RDTP_M  0xFFFFFFFCU  // Receive Descriptor Tail
                                               // Pointer

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_TXDESC_RING_LENGTH register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_TXDESC_RING_LENGTH_TDRL_S  0U
#define ETHERNET_DMA_CH1_TXDESC_RING_LENGTH_TDRL_M  0x3FFU       // Transmit Descriptor Ring
                                               // Length

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_RXDESC_RING_LENGTH register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_RXDESC_RING_LENGTH_RDRL_S  0U
#define ETHERNET_DMA_CH1_RXDESC_RING_LENGTH_RDRL_M  0x3FFU       // Receive Descriptor Ring
                                               // Length

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_INTERRUPT_ENABLE register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_TIE  0x1U         // Transmit Interrupt Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_TXSE  0x2U         // Transmit Stopped Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_TBUE  0x4U         // Transmit Buffer Unavailable
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_RIE  0x40U        // Receive Interrupt Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_RBUE  0x80U        // Receive Buffer Unavailable
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_RSE  0x100U       // Receive Stopped Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_RWTE  0x200U       // Receive Watchdog Timeout
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_ETIE  0x400U       // Early Transmit Interrupt
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_ERIE  0x800U       // Early Receive Interrupt
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_FBEE  0x1000U      // Fatal Bus Error Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_CDEE  0x2000U      // Context Descriptor Error
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_AIE  0x4000U      // Abnormal Interrupt Summary
                                               // Enable
#define ETHERNET_DMA_CH1_INTERRUPT_ENABLE_NIE  0x8000U      // Normal Interrupt Summary
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_S  0U
#define ETHERNET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWT_M  0xFFU        // Receive Interrupt Watchdog
                                               // Timer Count
#define ETHERNET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_S  16U
#define ETHERNET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_M  0x30000U     // Receive Interrupt Watchdog
                                               // Timer Count Units

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_STATUS register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_STATUS_TI    0x1U         // Transmit Interrupt
#define ETHERNET_DMA_CH1_STATUS_TPS   0x2U         // Transmit Process Stopped
#define ETHERNET_DMA_CH1_STATUS_TBU   0x4U         // Transmit Buffer Unavailable
#define ETHERNET_DMA_CH1_STATUS_RI    0x40U        // Receive Interrupt
#define ETHERNET_DMA_CH1_STATUS_RBU   0x80U        // Receive Buffer Unavailable
#define ETHERNET_DMA_CH1_STATUS_RPS   0x100U       // Receive Process Stopped
#define ETHERNET_DMA_CH1_STATUS_RWT   0x200U       // Receive Watchdog Timeout
#define ETHERNET_DMA_CH1_STATUS_ETI   0x400U       // Early Transmit Interrupt
#define ETHERNET_DMA_CH1_STATUS_ERI   0x800U       // Early Receive Interrupt
#define ETHERNET_DMA_CH1_STATUS_FBE   0x1000U      // Fatal Bus Error
#define ETHERNET_DMA_CH1_STATUS_CDE   0x2000U      // Context Descriptor Error
#define ETHERNET_DMA_CH1_STATUS_AIS   0x4000U      // Abnormal Interrupt Summary
#define ETHERNET_DMA_CH1_STATUS_NIS   0x8000U      // Normal Interrupt Summary
#define ETHERNET_DMA_CH1_STATUS_TEB_S  16U
#define ETHERNET_DMA_CH1_STATUS_TEB_M  0x70000U     // Tx DMA Error Bits
#define ETHERNET_DMA_CH1_STATUS_REB_S  19U
#define ETHERNET_DMA_CH1_STATUS_REB_M  0x380000U    // Rx DMA Error Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CH1_MISS_FRAME_CNT register
//
//*****************************************************************************
#define ETHERNET_DMA_CH1_MISS_FRAME_CNT_MFC_S  0U
#define ETHERNET_DMA_CH1_MISS_FRAME_CNT_MFC_M  0x7FFU       // Dropped Packet Counters
#define ETHERNET_DMA_CH1_MISS_FRAME_CNT_MFCO  0x8000U      // Overflow status of the MFC
                                               // Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_OPERATION_MODE register
//
//*****************************************************************************
#define ETHERNET_MTL_OPERATION_MODE_DTXSTS  0x2U         // Drop Transmit Status
#define ETHERNET_MTL_OPERATION_MODE_RAA  0x4U         // Receive Arbitration Algorithm
#define ETHERNET_MTL_OPERATION_MODE_SCHALG_S  5U
#define ETHERNET_MTL_OPERATION_MODE_SCHALG_M  0x60U        // Tx Scheduling Algorithm
#define ETHERNET_MTL_OPERATION_MODE_CNTPRST  0x100U       // Counters Preset
#define ETHERNET_MTL_OPERATION_MODE_CNTCLR  0x200U       // Counters Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_DBG_CTL register
//
//*****************************************************************************
#define ETHERNET_MTL_DBG_CTL_FDBGEN   0x1U         // FIFO Debug Access Enable
#define ETHERNET_MTL_DBG_CTL_DBGMOD   0x2U         // Debug Mode Access to FIFO
#define ETHERNET_MTL_DBG_CTL_BYTEEN_S  2U
#define ETHERNET_MTL_DBG_CTL_BYTEEN_M  0xCU         // Byte Enables
#define ETHERNET_MTL_DBG_CTL_PKTSTATE_S  5U
#define ETHERNET_MTL_DBG_CTL_PKTSTATE_M  0x60U        // Encoded Packet State
#define ETHERNET_MTL_DBG_CTL_RSTALL   0x100U       // Reset All Pointers
#define ETHERNET_MTL_DBG_CTL_RSTSEL   0x200U       // Reset Pointers of Selected
                                               // FIFO
#define ETHERNET_MTL_DBG_CTL_FIFORDEN  0x400U       // FIFO Read Enable
#define ETHERNET_MTL_DBG_CTL_FIFOWREN  0x800U       // FIFO Write Enable
#define ETHERNET_MTL_DBG_CTL_FIFOSEL_S  12U
#define ETHERNET_MTL_DBG_CTL_FIFOSEL_M  0x3000U      // FIFO Selected for Access
#define ETHERNET_MTL_DBG_CTL_PKTIE    0x4000U      // Receive Packet Available
                                               // Interrupt Status Enable
#define ETHERNET_MTL_DBG_CTL_STSIE    0x8000U      // Transmit Status Available
                                               // Interrupt Status Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_DBG_STS register
//
//*****************************************************************************
#define ETHERNET_MTL_DBG_STS_FIFOBUSY  0x1U         // FIFO Busy
#define ETHERNET_MTL_DBG_STS_PKTSTATE_S  1U
#define ETHERNET_MTL_DBG_STS_PKTSTATE_M  0x6U         // Encoded Packet State
#define ETHERNET_MTL_DBG_STS_BYTEEN_S  3U
#define ETHERNET_MTL_DBG_STS_BYTEEN_M  0x18U        // Byte Enables
#define ETHERNET_MTL_DBG_STS_PKTI     0x100U       // Receive Packet Available
                                               // Interrupt Status
#define ETHERNET_MTL_DBG_STS_STSI     0x200U       // Transmit Status Available
                                               // Interrupt Status
#define ETHERNET_MTL_DBG_STS_LOCR_S   15U
#define ETHERNET_MTL_DBG_STS_LOCR_M   0xFFFF8000U  // Remaining Locations in the
                                               // FIFO

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_INTERRUPT_STATUS register
//
//*****************************************************************************
#define ETHERNET_MTL_INTERRUPT_STATUS_Q0IS  0x1U         // Queue 0 Interrupt status
#define ETHERNET_MTL_INTERRUPT_STATUS_Q1IS  0x2U         // Queue 1 Interrupt status
#define ETHERNET_MTL_INTERRUPT_STATUS_DBGIS  0x20000U     // Debug Interrupt status

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ_DMA_MAP0 register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ_DMA_MAP0_Q0MDMACH  0x1U         // Queue 0 Mapped to DMA Channel
#define ETHERNET_MTL_RXQ_DMA_MAP0_Q0DDMACH  0x10U        // Queue 0 Enabled for DA-based
                                               // DMA Channel Selection
#define ETHERNET_MTL_RXQ_DMA_MAP0_Q1MDMACH  0x100U       // Queue 1 Mapped to DMA Channel
#define ETHERNET_MTL_RXQ_DMA_MAP0_Q1DDMACH  0x1000U      // Queue 1 Enabled for DA-based
                                               // DMA Channel Selection

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ0_OPERATION_MODE register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_FTQ  0x1U         // Flush Transmit Queue
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TSF  0x2U         // Transmit Store and Forward
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TXQEN_S  2U
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TXQEN_M  0xCU         // Transmit Queue Enable
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TTC_S  4U
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TTC_M  0x70U        // Transmit Threshold Control
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TQS_S  16U
#define ETHERNET_MTL_TXQ0_OPERATION_MODE_TQS_M  0xF0000U     // Transmit Queue Size

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ0_UNDERFLOW register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ0_UNDERFLOW_UFFRMCNT_S  0U
#define ETHERNET_MTL_TXQ0_UNDERFLOW_UFFRMCNT_M  0x7FFU       // Underflow Packet Counter
#define ETHERNET_MTL_TXQ0_UNDERFLOW_UFCNTOVF  0x800U       // Overflow Bit for Underflow
                                               // Packet Counter

