TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ0_DEBUG register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ0_DEBUG_TXQPAUSED  0x1U         // Transmit Queue in Pause
#define ETHERNET_MTL_TXQ0_DEBUG_TRCSTS_S  1U
#define ETHERNET_MTL_TXQ0_DEBUG_TRCSTS_M  0x6U         // MTL Tx Queue Read Controller
                                               // Status
#define ETHERNET_MTL_TXQ0_DEBUG_TWCSTS  0x8U         // MTL Tx Queue Write Controller
                                               // Status
#define ETHERNET_MTL_TXQ0_DEBUG_TXQSTS  0x10U        // MTL Tx Queue Not Empty Status
#define ETHERNET_MTL_TXQ0_DEBUG_TXSTSFSTS  0x20U        // MTL Tx Status FIFO Full
                                               // Status
#define ETHERNET_MTL_TXQ0_DEBUG_PTXQ_S  16U
#define ETHERNET_MTL_TXQ0_DEBUG_PTXQ_M  0x70000U     // Number of Packets in the
                                               // Transmit Queue
#define ETHERNET_MTL_TXQ0_DEBUG_STXSTSF_S  20U
#define ETHERNET_MTL_TXQ0_DEBUG_STXSTSF_M  0x700000U    // Number of Status Words in Tx
                                               // Status FIFO of Queue

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ0_ETS_STATUS register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ0_ETS_STATUS_ABS_S  0U
#define ETHERNET_MTL_TXQ0_ETS_STATUS_ABS_M  0xFFFFFFU    // Average Bits per Slot

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ0_QUANTUM_WEIGHT register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_S  0U
#define ETHERNET_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_M  0x1FFFFFU    // Quantum or Weights

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_Q0_INTERRUPT_CONTROL_STATUS register
//
//*****************************************************************************
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS  0x1U         // Transmit Queue Underflow
                                               // Interrupt Status
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS  0x2U         // Average Bits Per Slot
                                               // Interrupt Status
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE  0x100U       // Transmit Queue Underflow
                                               // Interrupt Enable
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE  0x200U       // Average Bits Per Slot
                                               // Interrupt Enable
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS  0x10000U     // Receive Queue Overflow
                                               // Interrupt Status
#define ETHERNET_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE  0x1000000U   // Receive Queue Overflow
                                               // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ0_OPERATION_MODE register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RTC_S  0U
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RTC_M  0x3U         // Receive Queue Threshold
                                               // Control
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_FUP  0x8U         // Forward Undersized Good
                                               // Packets
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_FEP  0x10U        // Forward Error Packets
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RSF  0x20U        // Receive Queue Store and
                                               // Forward
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF  0x40U        // Disable Dropping of TCP/IP
                                               // Checksum Error Packets
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_EHFC  0x80U        // Enable Hardware Flow Control
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RFA_S  8U
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RFA_M  0x700U       // Threshold for Activating Flow
                                               // Control (in half-duplex and
                                               // full-duplex
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RFD_S  14U
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RFD_M  0x1C000U     // Threshold for Deactivating
                                               // Flow Control (in half-duplex and
                                               // full-duplex modes)
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RQS_S  20U
#define ETHERNET_MTL_RXQ0_OPERATION_MODE_RQS_M  0xF00000U    // Receive Queue Size

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_S  0U
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_M  0x7FFU       // Overflow Packet Counter
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF  0x800U       // Overflow Counter Overflow Bit
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_S  16U
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_M  0x7FF0000U   // Missed Packet Counter
#define ETHERNET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF  0x8000000U   // Missed Packet Counter
                                               // Overflow Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ0_DEBUG register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ0_DEBUG_RWCSTS  0x1U         // MTL Rx Queue Write Controller
                                               // Active Status
#define ETHERNET_MTL_RXQ0_DEBUG_RRCSTS_S  1U
#define ETHERNET_MTL_RXQ0_DEBUG_RRCSTS_M  0x6U         // MTL Rx Queue Read Controller
                                               // State
#define ETHERNET_MTL_RXQ0_DEBUG_RXQSTS_S  4U
#define ETHERNET_MTL_RXQ0_DEBUG_RXQSTS_M  0x30U        // MTL Rx Queue Fill-Level
                                               // Status
#define ETHERNET_MTL_RXQ0_DEBUG_PRXQ_S  16U
#define ETHERNET_MTL_RXQ0_DEBUG_PRXQ_M  0x3FFF0000U  // Number of Packets in Receive
                                               // Queue

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ0_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ0_CONTROL_RXQ_WEGT_S  0U
#define ETHERNET_MTL_RXQ0_CONTROL_RXQ_WEGT_M  0x7U         // Receive Queue Weight
#define ETHERNET_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT  0x8U         // Receive Queue Packet
                                               // Arbitration

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ1_OPERATION_MODE register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_FTQ  0x1U         // Flush Transmit Queue
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TSF  0x2U         // Transmit Store and Forward
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TXQEN_S  2U
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TXQEN_M  0xCU         // Transmit Queue Enable
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TTC_S  4U
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TTC_M  0x70U        // Transmit Threshold Control
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TQS_S  16U
#define ETHERNET_MTL_TXQ1_OPERATION_MODE_TQS_M  0xF0000U     // Transmit Queue Size

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ1_UNDERFLOW register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ1_UNDERFLOW_UFFRMCNT_S  0U
#define ETHERNET_MTL_TXQ1_UNDERFLOW_UFFRMCNT_M  0x7FFU       // Underflow Packet Counter
#define ETHERNET_MTL_TXQ1_UNDERFLOW_UFCNTOVF  0x800U       // Overflow Bit for Underflow
                                               // Packet Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ1_DEBUG register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ1_DEBUG_TXQPAUSED  0x1U         // Transmit Queue in Pause
#define ETHERNET_MTL_TXQ1_DEBUG_TRCSTS_S  1U
#define ETHERNET_MTL_TXQ1_DEBUG_TRCSTS_M  0x6U         // MTL Tx Queue Read Controller
                                               // Status
#define ETHERNET_MTL_TXQ1_DEBUG_TWCSTS  0x8U         // MTL Tx Queue Write Controller
                                               // Status
#define ETHERNET_MTL_TXQ1_DEBUG_TXQSTS  0x10U        // MTL Tx Queue Not Empty Status
#define ETHERNET_MTL_TXQ1_DEBUG_TXSTSFSTS  0x20U        // MTL Tx Status FIFO Full
                                               // Status
#define ETHERNET_MTL_TXQ1_DEBUG_PTXQ_S  16U
#define ETHERNET_MTL_TXQ1_DEBUG_PTXQ_M  0x70000U     // Number of Packets in the
                                               // Transmit Queue
#define ETHERNET_MTL_TXQ1_DEBUG_STXSTSF_S  20U
#define ETHERNET_MTL_TXQ1_DEBUG_STXSTSF_M  0x700000U    // Number of Status Words in Tx
                                               // Status FIFO of Queue

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ1_ETS_STATUS register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ1_ETS_STATUS_ABS_S  0U
#define ETHERNET_MTL_TXQ1_ETS_STATUS_ABS_M  0xFFFFFFU    // Average Bits per Slot

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_TXQ1_QUANTUM_WEIGHT register
//
//*****************************************************************************
#define ETHERNET_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_S  0U
#define ETHERNET_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_M  0x1FFFFFU    // idleSlopeCredit, Quantum or
                                               // Weights

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_Q1_INTERRUPT_CONTROL_STATUS register
//
//*****************************************************************************
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS  0x1U         // Transmit Queue Underflow
                                               // Interrupt Status
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS  0x2U         // Average Bits Per Slot
                                               // Interrupt Status
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE  0x100U       // Transmit Queue Underflow
                                               // Interrupt Enable
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE  0x200U       // Average Bits Per Slot
                                               // Interrupt Enable
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS  0x10000U     // Receive Queue Overflow
                                               // Interrupt Status
#define ETHERNET_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE  0x1000000U   // Receive Queue Overflow
                                               // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ1_OPERATION_MODE register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RTC_S  0U
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RTC_M  0x3U         // Receive Queue Threshold
                                               // Control
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_FUP  0x8U         // Forward Undersized Good
                                               // Packets
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_FEP  0x10U        // Forward Error Packets
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RSF  0x20U        // Receive Queue Store and
                                               // Forward
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF  0x40U        // Disable Dropping of TCP/IP
                                               // Checksum Error Packets
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_EHFC  0x80U        // Enable Hardware Flow Control
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RFA_S  8U
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RFA_M  0x700U       // Threshold for Activating Flow
                                               // Control (in half-duplex and
                                               // full-duplex
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RFD_S  14U
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RFD_M  0x1C000U     // Threshold for Deactivating
                                               // Flow Control (in half-duplex and
                                               // full-duplex modes)
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RQS_S  20U
#define ETHERNET_MTL_RXQ1_OPERATION_MODE_RQS_M  0xF00000U    // Receive Queue Size

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_S  0U
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_M  0x7FFU       // Overflow Packet Counter
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF  0x800U       // Overflow Counter Overflow Bit
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_S  16U
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_M  0x7FF0000U   // Missed Packet Counter
#define ETHERNET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF  0x8000000U   // Missed Packet Counter
                                               // Overflow Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ1_DEBUG register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ1_DEBUG_RWCSTS  0x1U         // MTL Rx Queue Write Controller
                                               // Active Status
#define ETHERNET_MTL_RXQ1_DEBUG_RRCSTS_S  1U
#define ETHERNET_MTL_RXQ1_DEBUG_RRCSTS_M  0x6U         // MTL Rx Queue Read Controller
                                               // State
#define ETHERNET_MTL_RXQ1_DEBUG_RXQSTS_S  4U
#define ETHERNET_MTL_RXQ1_DEBUG_RXQSTS_M  0x30U        // MTL Rx Queue Fill-Level
                                               // Status
#define ETHERNET_MTL_RXQ1_DEBUG_PRXQ_S  16U
#define ETHERNET_MTL_RXQ1_DEBUG_PRXQ_M  0x3FFF0000U  // Number of Packets in Receive
                                               // Queue

//*****************************************************************************
//
// The following are defines for the bit fields in the MTL_RXQ1_CONTROL register
//
//*****************************************************************************
#define ETHERNET_MTL_RXQ1_CONTROL_RXQ_WEGT_S  0U
#define ETHERNET_MTL_RXQ1_CONTROL_RXQ_WEGT_M  0x7U         // Receive Queue Weight
#define ETHERNET_MTL_RXQ1_CONTROL_RXQ_FRM_ARBIT  0x8U         // Receive Queue Packet
                                               // Arbitration
#endif
